{
  "papers" : [
    {
      "title" : "Superconducting disordered neural networks for neuromorphic processing with fluxons",
      "phrases" : {
        "Introduction" : [
          "Realizing a physical system that can mimic information processing in biological brains [known as a neuromorphic computer (1)] is a primary objective of next-generation artificial intelligence systems and motivation for this work",
          "varying their connection strengths or weights, memory storage can be represented and can either be potentiated or be depressed in response to the information flow (13)",
          "This potential energy profile inspires the exploration of materials and devices that exhibit tunable electrical conductance behavior for use as synapses in neuromorphic computing (14–17).",
          "neuromorphic computation has been broadly understood as an emergent phenomenon arising from the collective behavior of these network elements through nonlinear interactions,",
          "Physical implementation of analog information processing in neural networks is similarly explored in systems that exhibit complex energy landscape with nonlinear spatial and temporal dynamics between network elements. Examples of such systems that result in emergent phenomena include disordered systems such as spin glasses (24, 25), coupled oscillator networks (26–28), and also experimentally explored in nanowire networks (29, 30).",
          "We have therefore proposed a spiking recurrent neural network architecture based on a disordered array of superconducting loops, where disorder is introduced in the form of circuit topology between network connections (i.e., synaptic network between neurons)",
          "nnections (i.e., synaptic network between neurons) (33, 34). Fluxon generation and propagation through Josephson junctions (35), observed as spiking voltages, are well understood, and superconducting loop–based circuits encompassing individual fluxons are subsequently developed for use in rapid single-flux quantum digital circuits for energy-efficient and high-speed digital computing (35–40).",
          "Collection of a large number of this quantized flux can similarly be stored in superconducting loops in the form of circulating supercurrents with Josephson junctions, interrupting that loop acting as gateways for their entrance or exit (36, 41).",
          "hese spiking signals can therefore represent both spatial and temporal information similar to that of biological brains. Therefore, a multiterminal network of disordered loops with junctions such as that shown in Fig. 1A can replicate the individual synaptic connections of a recurrent neural network such as that shown in Fig. 1B, where complex nonlinear interactions between the incoming and the stored fluxons result in variation of the average flow of spiking signals between any pair of input-output terminals, as shown in Fig. 1C.",
          "The rate of flow of fluxons between any two terminals, defined quantitatively and demonstrated experimentally in Results and discussion, may be characterized as synaptic weight between them.",
          "The input spike trains from all the terminals are converted into current pulses that take various time-dependent paths through Josephson junctions shown as i1, i2, etc. Some current pulses switch Josephson junctions above their critical currents and are stored as circulating currents in adjacent loops (i.e., flux perpendicular to the plane), representing the memory state of the synapse. The switching event and the generation/transfer of flux quanta are schematically shown using the dotted circle, and the flux stored in various loops is represented as n10, n20, etc.",
          "where disorder is introduced into the network architecture in the form of geometry and physical properties of loops and Josephson junctions (i.e., the loop inductances and junction critical currents).",
          "These networks can be combined with compatible elements such as superconducting spiking neurons (10, 11, 33, 34) etc., to form fully connected recurrent neural networks that can be configured to perform both supervised and unsupervised learning.",
          "Therefore, the total number of distinct static memory configurations available for an array with number of loops equal to i is given by (2n1 + 1) · (2n2 + 1) ·⋯ (2ni + 1), accounting for states with no current, clockwise- or anticlockwise-circulating currents in the loops. This number grows exponentially as the number of loops increase.",
          "Because of the presence of nonuniform loop inductances and junction critical currents, each of the pathways for the flow of flux between any two terminals is subjected to a distinct energy landscape that is dependent on the memory state, as well as the input conditions, similar to the models described in (18,  21,  24).",
          "As the flux gets trapped and is propagating between loops, the memory state and its corresponding energy configuration define the propagation probability of an input fluxon (and, therefore, the corresponding fluxon flow rate) through any of the available paths (allowing measurement of the memory state and its time evolution) as shown schematically in Fig. 1C.",
          "Therefore, the potential energy of the loop depends on the flux stored along with the input and control currents",
          "The different paths represent synaptic weights. While it is considerably complex to experimentally determine the energy distribution in each of these paths as a function of time, the effect of different energy landscapes on fluxon flow rates can be experimentally measured as shown as in the following section"
        ],
        "Static Operation" : [
          "The applied currents are substantially larger than the critical currents of the junctions or the circulating currents corresponding to different memory states. This is, by design, such that the flux propagation through the network occurs at very high frequencies (up to terahertz), and the resulting memory states are stable and considerably distinct in their respective energy landscapes.",
          "Only such memory states are observed as causing substantial differences in rates of flux flow, and the patterns in these emergent memory states are clearly seen, as input conditions are varied. However, at much lower currents, the differences in flow rates between each different memory state may be observed in the output spiking signals. We note that the frequencies of sinusoidal current inputs are in the range of a few hertz to 1  kHz. This is five orders of magnitude slower than the corresponding spiking frequencies and, therefore, allows enough time for the system to relax to a local energy minimum (representing the memory state), behaving as a quasi-static system on the time scale of applied currents.",
          "Our results show that multiple stable memory states exist (different values of d VO1 d _VI1 ), labeled as S1, S2, ... S6 in Fig. 4A, during which the rate of flow of fluxons between the input-output terminals remains constant.",
          "The changes in the slope of these linear regions correspond to the transitions in memory states, indicating that the total current through different paths changes with memory (flux) configurations.",
          "The transitions can also occur over a range of voltages (for example, between −2 and 0 mV for currents between −500 and 0 A in Fig. 3A), where the changes in current paths from one configuration to the other is gradual, therefore acting as another stable memory state shown as S4 in Fig. 4.",
          "These stable states correspond to sets of trapped flux configurations during which the changes in current through the junction at O1 is negligible. This is because the applied currents at I1 and B1 are considerably larger than the circulating currents due to flux in loops. However, differences in the flow rates are significant between different stable states. Distinctions in flow rates between each fluxon configuration (memory state) are expected to be observed when the currents through any of the paths are of magnitude similar to the critical currents of junctions in that path.",
          "Increasing B1 (Fig. 4A) results in new memory states gradually emerging from within the existing states. Two such instances are observed with state S4 emerging between B1 of 6 and 11 A (schematically shown in Fig. 2D) and with state S3 emerging between 22 and 26 A.",
          "These different states correspond to one of the junctions switching between the superconducting and voltage states either abruptly (i.e., at fixed values of I1 or B1) or gradually over a range of values of I1 due to continuous transfer of flux quanta between loops.",
          "The voltage range (bandwidth) of the memory state increased from 0.4 mV (193 GHz) at B1 of 0 A to 0.8 mV (387 GHz) at B1 of 26 A and remains constant at larger currents. Similar patterns are observed in all the other memory states, where the bandwidth and voltage ranges for the memory states and their emergence can be continuously tuned."
        ],
        "Dynamic Operation" : [
          "The results in the previous section prove that stable memory/flux configurations exist in synapse networks that can be classified into different categories corresponding to their rates of flow of flux quanta between the input-output nodes in the state space defined by input voltage VI1 and output voltage VO1.",
          "A leaky integrate-and-fire neuron such as that discussed in (33) can be configured to generate action potentials over a specific range of frequencies defined by ±fT, where fT is the frequency threshold of the neuron, acting as a band-pass filter for spiking signals. Here, the negative frequency represents flux flow in the opposite direction. Therefore, the relative population densities of outgoing flux quanta associated with each memory state defined in a configurable frequency window ±fT can be measured.",
          "However, during the neural network operation of the disordered array of superconducting loops, the input spike frequency dynamically changes with respect to the control current (i.e., both the signals are actively changing with respect to each other). While the spiking input signal maps the spatial and temporal information on to the memory state space, the feedback/control current signal reconfigures the memory state space according to the outgoing spike signals during the learning process.,",
          "As phase difference  is varied between 0 and 2, state transitions move around the state space of VI1 and VO1, as the span of frequency windows, i.e., the bandwidths across which the transitions are observed, changes in size.",
          "To further explore the memory states and their transitions in the space defined by VI1 and VO1, frequency of one of the currents, i.e., B1, is varied with respect to the other, i.e., I1, and the results are shown in Fig. 6. By systematically increasing the frequency of one of the current signals with respect to another, the entire memory state space where the neural network can operate (for the given bandwidth) has been mapped. Here, a current amplitude of 1 mA and frequency of 1 Hz is applied at I1, while a current amplitude of 100 A is applied at B1 with its frequency varying from 1 to 100 Hz. Different memory state classifications separated by their transitions evolve as the frequency ratio is increased. Each of these memory states corresponds to a different fluxon flow rate between I1 and O1 (Fig. 2). An almost continuous state space is divided into nine different categories that can be distinguished by various transitions caused by different junctions in the network switching into and out of the superconducting state.",
          "We note that the transitions are also labeled as memory states here as they present a region in the state space where they are stable.",
          "As the corresponding transient current flows through different paths of the disordered network into multiple outputs as shown in Fig. 1, the information is classified or clustered into different categories that can be observed in the form of different populations of flux quanta across the stable memory states observed in the frequency state space of input and output spiking signals.",
          "This superconducting disordered loop array architecture–based network also provides a platform to explore rich spatial and temporal dynamics associated with analog neural networks.",
          "The role of disorder in neuromorphic network architectures can be understood through complex superconducting networks, which can also be expanded to other material systems such as that discussed in (34). However, superconducting networks correspond to superior operating speeds with maximum spike frequencies up to a few terahertz with an ultralow-energy dissipation in the order of ≈2 × 10−18 J per spike, with power dissipation dependent on the operating frequencies.",
          "n addition, the proposed YBCObased superconducting loops enable high scalability with loop widths as small as 10 nm (50), higher operation temperatures, and exponentially scaling memory capacity with a number of loops."
        ]
      },
      "cites" : {
        "[10]" : "P. Crotty, D. Schult, K. Segall, Josephson junction simulation of neurons. Phys. Rev. E 82, 011914 (2010).",
        "[14]" : "H.-T. Zhang, T. J. Park, I. A. Zaluzhnyy, Q. Wang, S. N. Wadekar, S. Manna, R. Andrawis, P. O. Sprau, Y. Sun, Z. Zhang, C. Huang, H. Zhou, Z. Zhang, B. Narayanan, G. Srinivasan, N. Hua, E. Nazaretski, X. Huang, H. Yan, M. Ge, Y. S. Chu, M. J. Cherukara, M. V. Holt, M. Krishnamurthy, O. G. Shpyrko, S.u. K. R. S. Sankaranarayanan, A. Frano, K. Roy, S. Ramanathan, Perovskite neural trees. Nat. Commun. 11, 2245 (2020).",
        "[15]" : "Y. Guo, H. Wu, B. Gao, H. Qian, Unsupervised learning on resistive memory array based spiking neural networks. Front. Neurosci. 13, 812 (2019).",
        "[17]" : "Y. Zhou, S. Ramanathan, Mott memory and neuromorphic devices. Proc. IEEE 103, 1289–1310 (2015).",
        "[34]" : "U. S. Goteti, I. A. Zaluzhnyy, S. Ramanathan, R. C. Dynes, A. Frano, Low-temperature emergent neuromorphic networks with correlated oxide devices. Proc. Natl. Acad. Sci. U.S.A. 118, e2103934118 (2021).",
        "[35]" : "T. A. Fulton, R. C. Dynes, P. W. Anderson, The flux shuttle—A josephson junction shift register employing single flux quanta. Proc. IEEE 61, 28–35 (1973).",
        "[42]" : "W. Hioe, E. Goto, Quantum Flux Parametron: A Single Quantum Flux Superconducting Logic Device (World Scientific, 1991), vol. 2."
      }
    }
  ]
}