{
  "papers" : [
    {
      "title" :"Wiring cost in the organization of a biological neuronal network",
      "phrases" : [
        "The remarkable feature of this nematode is that most individuals of C. eleganshave almost the same cellular properties such as shapes, connectivities and positions of neurons, which makes it possible to label each neuron",
        "In this issue, a powerful approach is focusing on the high effectiveness of biosystems because of the very essentiality of natural selection in the evolution.",
        "For example, the average distance between two metabolites of 43 microorganisms’ metabolic networks remain the same even though their numbers of nodes span from 200 to 80 [13]",
        "In these models, a total cost is defined as the number of edges (or total length of edges) and the effectiveness is defined by several different measures, e.g. the short characteristic path length. The energy function to be optimized is defined using the cost and the effectiveness measures, and then, by minimizing the energy function, the scale-free network emerges as a result.",
        "Interestingly, the neuronal network of C.elegans shows worse performance than Barabasi–Albert (BA) network [10] and Watts–Strogatz (WS) network [9] with the rewiring probability p ¼ 1:0 [23].",
        "Although the use of the pattern recognition in the Hopfield model as a generic measure of the network performance can hardly be justified, we strongly believe that the clustering coefficient can be a good measure of network performance. In more detail, the large clustering coefficient in a given network implies that there exist many short detouring connections. In the point of view of network performance, we are wasting our precious resources if we make too many triangles in networks since those edges participating in triangles could equally have been used to connect remote vertices. Consequently, the worse performance of the C. elegans neuronal network in Ref. [23] appears to suggest that the performance of the network competes with other measures.",
        "If we are allowed to use as many connections as we want, we can make network functioning very well by using sufficiently many edges. However, putting more edges consumes more resourcesin practice, and thus there should be a trade-off relation between the performance and the cost (measured as the total number of edges in this case).",
        "In this perspective, the cascading failure (the large-scale blackout) in power grid can be understood as the dark side effect of enhancing network performance.",
        "The non-cumulative distribution function P(d),  measuring how many interneuronal connections of the length d exist, is obtained from the derivative of the cumulative distribution with respect to d: the steeper slope in Fig. 2 at small d indicates that there are more shorter connections than longer ones, validating the concept of the wiring cost in the present work.",
        "The second method is the vertex swapping (VS) shuffling method [24], in which two randomly chosen vertices simply exchange their positions while preserving all the connections.",
        "In other words, the original neuronal network can be made to have a smaller wiring cost without changing the connection topology at all by simply changing the neuronal positions. In this regard, it is very interesting to note that if we remove body-spanning long connections of lengths larger than 0.75, the ratio of wiring costs between the original network and the optimized one is changed much from 0.53 to 0.67. This suggests that there are many long-range interneuronal connections that have to be placed without consideration of the wiring cost. Accordingly, if we neglect those long-range connections, role of wiring cost becomes more important in organization of network.",
        "As was discussed above in this paper, we believe that clustering coefficient can detect the network performance in the sense that high clustering in general corresponds to redundant wirings in the network",
        "The clearly observed negative correlation between the two quantities in Fig. 4 implies that wiring cost can only be reduced at the expense of network performance. Accordingly, although the neuronal network can be made more efficient (by reducing clustering coefficient), this can be achieved only by increasing wiring cost.",
        "First, possible reason is the existence of the neuropile, such as nerve ring and ventral cord. If two neurons are connected through these structures, actual wiring may not cost too much although two neurons are separated by a long distance. Second reason one can think of is the functional constraints as mentioned above: the minimal subnetwork topologies for generating certain dynamical behaviors such as oscillation or chaotic motion are identified and named as ‘‘dynamical motifs’’ in Ref. [26], which has shown that some network topologies are unavoidable to perform certain behaviors regardless of wiring cost. One can also argue that full optimization of network structure can hardly be realized in actual biological evolution: the developmental process of every living organism is highly conserved through history of life [27]. Even if C. elegans can minimize the wiring cost by modifying developmental process, this may not happen if the risk of failures in development is too great."
      ],
      "cites" : {
        "[9]" : "D.J. Watts, S.H. Strogatz, Nature (London) 393 (1998) 440.",
        "[10]" : [
          "A.-L. Baraba´ si, R. Albert, Science 286 (1999) 509;",
          "A.-L. Baraba´ si, R. Albert, H. Jeong, Physica A 272 (1999) 173."
        ],
        "[13]" : "H. Jeong, B. Tomber, R. Albert, Z.N. Oltvai, A.-L. Barabasi, Nature (London) 407 (2000) 651.",
        "[23]" : "B.J. Kim, Phys. Rev. E 69 (2004) 045101(R).",
        "[24]" : "C. Cherniak, J. Neurosci. 14 (1994) 2408.",
        "[26]" : "V.P. Zhigulin, Phys. Rev. Lett. 92 (2004) 238701.",
        "[27]" : "L. Wolpert, R. Beddington, T. Jessell, P. Lawrence, E. Meyerowitz, J. Smith, Principles of Development, Oxford University Press, New York, 2002."
      }
    },
    {
      "title" : "Communication in Neuronal Networks",
      "phrases" : [
        "Recent work suggests that their structure and fimction are governed by basic principles of resource allocation and constraint minimization, and that some of these principles are shared with human-made electronic devices and communications networks",
        "Because many of these changes are driven by spatial and temporal patterns of neural signals, neuronal netsvorks can adapt to circumstances, self-assemble, autocalibrate, and store informa- tion by changing their properties according to experience",
        "Economy and efficiency are guiding princi- ples in physiology that explain, for example, the way in which the lungs, the circulation, and the mitochondria are matched and co- regulated to supply energy to muscles (2).",
        "The size of a nervous system can be reduced by reducing the num- ber of neurons required for adequate function, by reducing the average size of neurons, or by laying out neurons so as to reduce the lengths of their connections.",
        "the connections between neurons occupy a substantial fraction of the total volume, and the wires (axons and den- drites) are expensive to operate because they dissipate energy during signali",
        "In chips, the components are arranged to reduce the total length of wiring. This same design principle has been established in the nematode worm Caenorhabditis elegans, which has 302 neurons arranged in 11 clusters called ganglia.",
        "About 60% of the gray matter is composed of axons and dendrites, reflecting a high degree of local connectivity analogous to a local area network. An ingenious analysis of resource allocation suggests that this wiring fraction of 60% minimizes local delays (10). This fraction strikes the optimum balance between two opposing tendencies: transmission speed and component density.",
        "Unlike the wires in chips, reducing the diameter of neural wires reduces the speed at which signals travel, prolonging delays. But it also reduces axon volume, and this allows neurons to be packed closer to- gether, thus shortening delays.",
        "The thickness of gray matter, just a few millimeters, is nearly constant in species that range in brain volume over five orders of magnitude. The volume of the white matter scales approximately as the 4/3 power of the volume of the gray matter, which can be explained by the need to maintain a fixed bandwidth of long-distance communication ca- pacity per unit area of the cortex (11)",
        "The layout of cortical areas niinimizes the total lengths of the axons needed to join them (12).",
        "The prominent folds of the human cortex allow the large cortical area to be packed in the skull but also allow cortical areas around the convolutions to minimize wire length; the location of the folds may even arise from elastic forces in the white matter during development (13).",
        "If we created a matrix with 101 rows and columns to represent the connections between every pair of cortical neurons, it would have a relatively dense set of entries around the diagonal but would have only sparse entries outside the diagonal, connecting blocks of neurons corresponding to cortical areas.",
        "Thus, only a small fraction of the computation that occurs locally can be reported to other areas, through a small fraction of the cells that connect distant cortical areas; but this may be enough to achieve activity that is coordinated in distant parts the brain, as reflected in the synchronous firing of action potentials in these areas, sup- ported by massive feedback projections be- tween cortical areas and reciprocal interactions with the thalamus (16, 17).",
        "Despite the sparseness of the cortical connection matrix, the potential bandwidth of all of the neurons in the human cortex is around a terabit per second (assuming a maximum rate of 100 bits/s over each axon in the white matter), comparable to the total world backbone capacity of the Internet in 2002 (18). However, this capacity is never achieved in practice because only a fraction of cortical neurons have a high rate of firing at any given time (see below). Re- cent work suggests that another physical constraint the provision of energy limits the brain's ability to harness its poten- tial bandwidth.",
        "Nervous systems consume metabolic energy continuously at relatively high rates per gram, comparable to those of heart muscle (19). Consequently, powering a brain is a major drain on an animal's energy budget, typically 2 to 10% of resting energy consumption. In humans this proportion is 20% for adults and 60% for infants (20), which suggests that the brain's energy demands limit its size (21).",
        "Energy supply limits signal traffic in the brain (Fig. 2). Deep anesthesia blocks neural signaling and halves the brain's energy con- sumption, which suggests that about 50% of the brain's energy is used to drive signals along axons and across synapses. The remainder sup- ports the maintenance of resting potentials and the vegetative function of neurons and glia.",
        "From the amounts of energy used when neurons signal, one can calculate the volume of signal traffic that can be supported by the brain's metabolic rate. For cerebral cortex, the permis- sible traffic is 5 action potentials per neuron per second in rat (Fig. 2) (22) and <1 per second in human (23). Given that the brain responds quickly, the permissible level of traf- fic is remarkably low, and this metabolic limit must influence the way in which information is processed.",
        "The observation that 1 mm3 of mouse cortex contains 10^5 neurons, 10^8 synapses, and 4 km of axon (24) suggests that, as in chip design, the brain reduces energy consumption by re-ducing the size and active area of components. Even though axon diameter is only 0.3 mum (on average), sending action potentials along these 'wires' consumes more than onethird of the energy supplied to cortical gray matter (22). Thus, as with computer chips, an efficient layout (discussed above) and a high component density are essential for energy efficiency but, as is also true for chips, miniaturization raises problems about noise.",
        "With respect to miniaturization, stochastic simulations (25) show that chan- nel noise places a realistic ceiling on the wiring den- sity of the brain by setting a lower limit of about 0.1 Fm on axon diameter.",
        "The cortex has many of the hallmarks of an energy-efficient hybrid device (28). In hybrid electronic devices, com- pact analog modules operate on signals to pro- cess information, and the results are converted to digital data for transmission through the net- work and then reconverted to analog data for further processing",
        "Given that a neuron is a noise- limited device of restricted bandwidth, the information rate is improved with the SNR, which increases as the square root of the number of ion channels, making improve- ments expensive (25).",
        "Given this relationship between noise and energy cost, an energy-efficient nervous system will divide information among a larg- er number of relatively noisy neurons of low- er information capacity, as observed in the splitting of retinal signals into ON and OFF pathways (32).",
        "Energy efficiency is improved when one reduc- es the number of signals in the network without losing information. In the nervous system, this amounts to an economy of impulses (33) that has the additional advantage of increasing sa- lience by laying out information concisely. Economy is achieved by eliminating redundan- cy. This important design principle is well es- tablished in sensory processing (34). Redun- dancy reduction is a goal of algorithms that compress files to reduce network traffic.",
        "In the brain, efficiency is improved by dis- tributing signals appropriately in time and space. Individual neurons adopt distributions of f¢ing rate (35, 36) that maximize the ratio between information coded and energy expend- ed.",
        "Networks of neurons achieve efficiency by distributing signals sparsely in space and time. Although it was already recognized that sparse coding improves energy efficiency (37), it was Levy and Baxter's detailed analysis of this problem (38) that initiated theoretical studies of energy-efficient coding in nervous systems.",
        "Sparse coding schemes, in which a small proportion of cells signal at any one time, use little energy for signaling but have a high representational ca- pacity, because there are many different ways in which a small number of signals can be distributed among a large number of neurons. When signals are relatively expensive, it is best to distribute a few of them among a large number of cells. When cells are expensive, it is more efficient to use few of them and to get all of them signaling. Estimates of the ratio between the energy demands of signaling and mainte- nance suggest that, for maximum efficiency, between 1% and 16% of neurons should be active at any one time (22, 23, 38).",
        "The optimum proportion of active cells depends on the ratio between the cost of maintaining a neuron at rest and the extra cost of sending a signal",
        "Does the energy- efficient cortical neuron, like the wise Internet user, select signals from sites that are most informative? This question draws energy effi- ciency into one of the most active and important areas of neuroscience: synaptic plasticity.",
        "Long-distance communication in the brain oc- curs through all-or-none action potentials, which are transmitted down axons and convert- ed to analog chemical and electrical signals at synapses. The initiation of action potentials in the cortex can occur with millisecond precision (41) but, as we have just discussed, the com- munication at cortical synapses is probabilistic.",
        "Oscillations in the 20- to 80-Hz range occur in the LFPs, and the coherence between spikes and these oscillations has been found to be influ- enced by attention and working memoxy (45)"
      ],
      "cites" : {
        "[1]" : "C. Koch, Biophysics of Computation: Information Processing in Single Neurons (Oxford Univ. Press, New York, 1999).",
        "[2]" : "E. R Weibel Symmorphosis: On Form and Function in Shaping Life (Harvard Univ. Press, Cambridge, MA, 2000).",
        "[10]" : "D. B. Chklovskii, T. Schikorski, C. F. Stevens, Neuron 34, 341 (2002).",
        "[11]" : "K. Zhang, T. J. Sejnowski, Proc. Natl. Acad. Sci. U.S.A. 97, 5621 (2000).",
        "[12]" : "V. A. Klyachko, C. F. Stevens, Proc. Natl. Acad. Sci. U.S.A. 100, 7937 (2003).",
        "[13]" : "D. C. V. Essen, Nature Rev. Neurosci. 385, 313 (1997).",
        "[16]" : "E. Salinas, T. J. Sejnowski, Nature Rev. Neurosci. 2, 539 (2001).",
        "[17]" : "A. Destexhe, T. J. Sejnowski, Thalamocortical Assem- blies: How lon Channels, Single Neurons and Large- Scale Networks Organize Sleep Oscillations (Oxford Univ. Press, Oxford, 2001).",
        "[18]" : "''Global Internet Backbone Growth Slows Dramatically'' (press release, 16 October 2002), TeleGeog- raphy (www.telegeography.com/press/releases/ 2002/1 6-oct-2002.html).",
        "[19]" : "A. Ames, Brain Res. Rev. 34, 42 (2000).",
        "[20]" : "M. A. Hofman, Q. Rev. Biol. 58, 495 (1983).",
        "[21]" : "L. C. Aiello, N. Bates, T. H. Joffe, in Evolutionary Anatomy of the Primate Cerebral Cortex, D. Falk, K. R. Gibson, Eds. (Cambridge Univ. Press, Cambridge, 2001), pp. 57-78.",
        "[25]" : "J. A. White, J. T. Rubinstein, A. R. Kay, Trends Neurosci. 23, 131 (2000).",
        "[28]" : "K. M. Franks, T. J. Sejnowski, Bioessays 12, 1130 (2002).",
        "[32]" : "T. von der Twer, D. I. MacLeod, Network 12, 395 (2001).",
        "[34]" : "E. P. Simoncelli, B. A. Olshausen, Annu. Rev. Neurosci. 24, 1193 (2001).",
        "[36]" : "V. Balasubramanian, M. J. Berry, Network 13, 531 (2002).",
        "[38]" : "W. B. Levy, R. A. Baxter, Neural Comput. 8, 531 (1996).",
        "[41]" : "Z. F. Mainen, T. J. Sejnowski, Science 268, 1503 (1995).",
        "[45]" : "P. Fries, J. H. Reynolds, A. E. Rorie, R. Desimone, Science 291, 1560 (2001).",
        "[46]" : "B. Pesaran, J. S. Pezaris, M. Sahani, P. P. Mitra, R. A. Andersen, Nature Neurosci. 5, 805 (2002)."
      }
    },
    {
      "title" : "Distributed Hierarchical Processing in the Primate Cerebral Cortex",
      "phrases" : [
        "The original notion of hierarchical processing in the visual cortex was put forward by Hubel and Wiesel (1962, 1965) to account for a progressive increase in the complexity of physiological receptive field properties in the cat visual cortex.",
        ""
      ]
    }
  ]
}