{
  "papers" : [
    {
      "title" :"Wiring cost in the organization of a biological neuronal network",
      "phrases" : [
        "The remarkable feature of this nematode is that most individuals of C. eleganshave almost the same cellular properties such as shapes, connectivities and positions of neurons, which makes it possible to label each neuron",
        "In this issue, a powerful approach is focusing on the high effectiveness of biosystems because of the very essentiality of natural selection in the evolution.",
        "For example, the average distance between two metabolites of 43 microorganisms’ metabolic networks remain the same even though their numbers of nodes span from 200 to 80 [13]",
        "In these models, a total cost is defined as the number of edges (or total length of edges) and the effectiveness is defined by several different measures, e.g. the short characteristic path length. The energy function to be optimized is defined using the cost and the effectiveness measures, and then, by minimizing the energy function, the scale-free network emerges as a result.",
        "Interestingly, the neuronal network of C.elegans shows worse performance than Barabasi–Albert (BA) network [10] and Watts–Strogatz (WS) network [9] with the rewiring probability p ¼ 1:0 [23].",
        "Although the use of the pattern recognition in the Hopfield model as a generic measure of the network performance can hardly be justified, we strongly believe that the clustering coefficient can be a good measure of network performance. In more detail, the large clustering coefficient in a given network implies that there exist many short detouring connections. In the point of view of network performance, we are wasting our precious resources if we make too many triangles in networks since those edges participating in triangles could equally have been used to connect remote vertices. Consequently, the worse performance of the C. elegans neuronal network in Ref. [23] appears to suggest that the performance of the network competes with other measures.",
        "If we are allowed to use as many connections as we want, we can make network functioning very well by using sufficiently many edges. However, putting more edges consumes more resourcesin practice, and thus there should be a trade-off relation between the performance and the cost (measured as the total number of edges in this case).",
        "In this perspective, the cascading failure (the large-scale blackout) in power grid can be understood as the dark side effect of enhancing network performance.",
        "The non-cumulative distribution function P(d),  measuring how many interneuronal connections of the length d exist, is obtained from the derivative of the cumulative distribution with respect to d: the steeper slope in Fig. 2 at small d indicates that there are more shorter connections than longer ones, validating the concept of the wiring cost in the present work.",
        "The second method is the vertex swapping (VS) shuffling method [24], in which two randomly chosen vertices simply exchange their positions while preserving all the connections.",
        "In other words, the original neuronal network can be made to have a smaller wiring cost without changing the connection topology at all by simply changing the neuronal positions. In this regard, it is very interesting to note that if we remove body-spanning long connections of lengths larger than 0.75, the ratio of wiring costs between the original network and the optimized one is changed much from 0.53 to 0.67. This suggests that there are many long-range interneuronal connections that have to be placed without consideration of the wiring cost. Accordingly, if we neglect those long-range connections, role of wiring cost becomes more important in organization of network.",
        "As was discussed above in this paper, we believe that clustering coefficient can detect the network performance in the sense that high clustering in general corresponds to redundant wirings in the network",
        "The clearly observed negative correlation between the two quantities in Fig. 4 implies that wiring cost can only be reduced at the expense of network performance. Accordingly, although the neuronal network can be made more efficient (by reducing clustering coefficient), this can be achieved only by increasing wiring cost.",
        "First, possible reason is the existence of the neuropile, such as nerve ring and ventral cord. If two neurons are connected through these structures, actual wiring may not cost too much although two neurons are separated by a long distance. Second reason one can think of is the functional constraints as mentioned above: the minimal subnetwork topologies for generating certain dynamical behaviors such as oscillation or chaotic motion are identified and named as ‘‘dynamical motifs’’ in Ref. [26], which has shown that some network topologies are unavoidable to perform certain behaviors regardless of wiring cost. One can also argue that full optimization of network structure can hardly be realized in actual biological evolution: the developmental process of every living organism is highly conserved through history of life [27]. Even if C. elegans can minimize the wiring cost by modifying developmental process, this may not happen if the risk of failures in development is too great."
      ],
      "cites" : {
        "[9]" : "D.J. Watts, S.H. Strogatz, Nature (London) 393 (1998) 440.",
        "[10]" : [
          "A.-L. Baraba´ si, R. Albert, Science 286 (1999) 509;",
          "A.-L. Baraba´ si, R. Albert, H. Jeong, Physica A 272 (1999) 173."
        ],
        "[13]" : "H. Jeong, B. Tomber, R. Albert, Z.N. Oltvai, A.-L. Barabasi, Nature (London) 407 (2000) 651.",
        "[23]" : "B.J. Kim, Phys. Rev. E 69 (2004) 045101(R).",
        "[24]" : "C. Cherniak, J. Neurosci. 14 (1994) 2408.",
        "[26]" : "V.P. Zhigulin, Phys. Rev. Lett. 92 (2004) 238701.",
        "[27]" : "L. Wolpert, R. Beddington, T. Jessell, P. Lawrence, E. Meyerowitz, J. Smith, Principles of Development, Oxford University Press, New York, 2002."
      }
    },
    {
      "title" : "Communication in Neuronal Networks",
      "phrases" : [
        "Recent work suggests that their structure and fimction are governed by basic principles of resource allocation and constraint minimization, and that some of these principles are shared with human-made electronic devices and communications networks",
        "Because many of these changes are driven by spatial and temporal patterns of neural signals, neuronal netvorks can adapt to circumstances, self-assemble, autocalibrate, and store information by changing their properties according to experience",
        "Economy and efficiency are guiding principles in physiology that explain, for example, the way in which the lungs, the circulation, and the mitochondria are matched and co-regulated to supply energy to muscles (2).",
        "The size of a nervous system can be reduced by reducing the number of neurons required for adequate function, by reducing the average size of neurons, or by laying out neurons so as to reduce the lengths of their connections.",
        "the connections between neurons occupy a substantial fraction of the total volume, and the wires (axons and dendrites) are expensive to operate because they dissipate energy during signali",
        "In chips, the components are arranged to reduce the total length of wiring. This same design principle has been established in the nematode worm Caenorhabditis elegans, which has 302 neurons arranged in 11 clusters called ganglia.",
        "About 60% of the gray matter is composed of axons and dendrites, reflecting a high degree of local connectivity analogous to a local area network. An ingenious analysis of resource allocation suggests that this wiring fraction of 60% minimizes local delays (10). This fraction strikes the optimum balance between two opposing tendencies: transmission speed and component density.",
        "Unlike the wires in chips, reducing the diameter of neural wires reduces the speed at which signals travel, prolonging delays. But it also reduces axon volume, and this allows neurons to be packed closer to- gether, thus shortening delays.",
        "The thickness of gray matter, just a few millimeters, is nearly constant in species that range in brain volume over five orders of magnitude. The volume of the white matter scales approximately as the 4/3 power of the volume of the gray matter, which can be explained by the need to maintain a fixed bandwidth of long-distance communication capacity per unit area of the cortex (11)",
        "The layout of cortical areas niinimizes the total lengths of the axons needed to join them (12).",
        "The prominent folds of the human cortex allow the large cortical area to be packed in the skull but also allow cortical areas around the convolutions to minimize wire length; the location of the folds may even arise from elastic forces in the white matter during development (13).",
        "If we created a matrix with 101 rows and columns to represent the connections between every pair of cortical neurons, it would have a relatively dense set of entries around the diagonal but would have only sparse entries outside the diagonal, connecting blocks of neurons corresponding to cortical areas.",
        "Thus, only a small fraction of the computation that occurs locally can be reported to other areas, through a small fraction of the cells that connect distant cortical areas; but this may be enough to achieve activity that is coordinated in distant parts the brain, as reflected in the synchronous firing of action potentials in these areas, supported by massive feedback projections between cortical areas and reciprocal interactions with the thalamus (16, 17).",
        "Despite the sparseness of the cortical connection matrix, the potential bandwidth of all of the neurons in the human cortex is around a terabit per second (assuming a maximum rate of 100 bits/s over each axon in the white matter), comparable to the total world backbone capacity of the Internet in 2002 (18). However, this capacity is never achieved in practice because only a fraction of cortical neurons have a high rate of firing at any given time (see below). Recent work suggests that another physical constraint the provision of energy limits the brain's ability to harness its potential bandwidth.",
        "Nervous systems consume metabolic energy continuously at relatively high rates per gram, comparable to those of heart muscle (19). Consequently, powering a brain is a major drain on an animal's energy budget, typically 2 to 10% of resting energy consumption. In humans this proportion is 20% for adults and 60% for infants (20), which suggests that the brain's energy demands limit its size (21).",
        "Energy supply limits signal traffic in the brain (Fig. 2). Deep anesthesia blocks neural signaling and halves the brain's energy consumption, which suggests that about 50% of the brain's energy is used to drive signals along axons and across synapses. The remainder supports the maintenance of resting potentials and the vegetative function of neurons and glia.",
        "From the amounts of energy used when neurons signal, one can calculate the volume of signal traffic that can be supported by the brain's metabolic rate. For cerebral cortex, the permissible traffic is 5 action potentials per neuron per second in rat (Fig. 2) (22) and <1 per second in human (23). Given that the brain responds quickly, the permissible level of traffic is remarkably low, and this metabolic limit must influence the way in which information is processed.",
        "The observation that 1 mm3 of mouse cortex contains 10^5 neurons, 10^8 synapses, and 4 km of axon (24) suggests that, as in chip design, the brain reduces energy consumption by reducing the size and active area of components. Even though axon diameter is only 0.3 mum (on average), sending action potentials along these 'wires' consumes more than onethird of the energy supplied to cortical gray matter (22). Thus, as with computer chips, an efficient layout (discussed above) and a high component density are essential for energy efficiency but, as is also true for chips, miniaturization raises problems about noise.",
        "With respect to miniaturization, stochastic simulations (25) show that channel noise places a realistic ceiling on the wiring density of the brain by setting a lower limit of about 0.1 Fm on axon diameter.",
        "The cortex has many of the hallmarks of an energy-efficient hybrid device (28). In hybrid electronic devices, compact analog modules operate on signals to process information, and the results are converted to digital data for transmission through the network and then reconverted to analog data for further processing",
        "Given that a neuron is a noise-limited device of restricted bandwidth, the information rate is improved with the SNR, which increases as the square root of the number of ion channels, making improve- ments expensive (25).",
        "Given this relationship between noise and energy cost, an energy-efficient nervous system will divide information among a larger number of relatively noisy neurons of lower information capacity, as observed in the splitting of retinal signals into ON and OFF pathways (32).",
        "Energy efficiency is improved when one reduces the number of signals in the network without losing information. In the nervous system, this amounts to an economy of impulses (33) that has the additional advantage of increasing sa- lience by laying out information concisely. Economy is achieved by eliminating redundancy. This important design principle is well established in sensory processing (34). Redundancy reduction is a goal of algorithms that compress files to reduce network traffic.",
        "In the brain, efficiency is improved by distributing signals appropriately in time and space. Individual neurons adopt distributions of f¢ing rate (35, 36) that maximize the ratio between information coded and energy expended.",
        "Networks of neurons achieve efficiency by distributing signals sparsely in space and time. Although it was already recognized that sparse coding improves energy efficiency (37), it was Levy and Baxter's detailed analysis of this problem (38) that initiated theoretical studies of energy-efficient coding in nervous systems.",
        "Sparse coding schemes, in which a small proportion of cells signal at any one time, use little energy for signaling but have a high representational ca- pacity, because there are many different ways in which a small number of signals can be distributed among a large number of neurons. When signals are relatively expensive, it is best to distribute a few of them among a large number of cells. When cells are expensive, it is more efficient to use few of them and to get all of them signaling. Estimates of the ratio between the energy demands of signaling and mainte- nance suggest that, for maximum efficiency, between 1% and 16% of neurons should be active at any one time (22, 23, 38).",
        "The optimum proportion of active cells depends on the ratio between the cost of maintaining a neuron at rest and the extra cost of sending a signal",
        "Does the energy- efficient cortical neuron, like the wise Internet user, select signals from sites that are most informative? This question draws energy efficiency into one of the most active and important areas of neuroscience: synaptic plasticity.",
        "Long-distance communication in the brain oc- curs through all-or-none action potentials, which are transmitted down axons and convert- ed to analog chemical and electrical signals at synapses. The initiation of action potentials in the cortex can occur with millisecond precision (41) but, as we have just discussed, the com- munication at cortical synapses is probabilistic.",
        "Oscillations in the 20- to 80-Hz range occur in the LFPs, and the coherence between spikes and these oscillations has been found to be influ- enced by attention and working memoxy (45)"
      ],
      "cites" : {
        "[1]" : "C. Koch, Biophysics of Computation: Information Processing in Single Neurons (Oxford Univ. Press, New York, 1999).",
        "[2]" : "E. R Weibel Symmorphosis: On Form and Function in Shaping Life (Harvard Univ. Press, Cambridge, MA, 2000).",
        "[10]" : "D. B. Chklovskii, T. Schikorski, C. F. Stevens, Neuron 34, 341 (2002).",
        "[11]" : "K. Zhang, T. J. Sejnowski, Proc. Natl. Acad. Sci. U.S.A. 97, 5621 (2000).",
        "[12]" : "V. A. Klyachko, C. F. Stevens, Proc. Natl. Acad. Sci. U.S.A. 100, 7937 (2003).",
        "[13]" : "D. C. V. Essen, Nature Rev. Neurosci. 385, 313 (1997).",
        "[16]" : "E. Salinas, T. J. Sejnowski, Nature Rev. Neurosci. 2, 539 (2001).",
        "[17]" : "A. Destexhe, T. J. Sejnowski, Thalamocortical Assem- blies: How lon Channels, Single Neurons and Large- Scale Networks Organize Sleep Oscillations (Oxford Univ. Press, Oxford, 2001).",
        "[18]" : "''Global Internet Backbone Growth Slows Dramatically'' (press release, 16 October 2002), TeleGeog- raphy (www.telegeography.com/press/releases/ 2002/1 6-oct-2002.html).",
        "[19]" : "A. Ames, Brain Res. Rev. 34, 42 (2000).",
        "[20]" : "M. A. Hofman, Q. Rev. Biol. 58, 495 (1983).",
        "[21]" : "L. C. Aiello, N. Bates, T. H. Joffe, in Evolutionary Anatomy of the Primate Cerebral Cortex, D. Falk, K. R. Gibson, Eds. (Cambridge Univ. Press, Cambridge, 2001), pp. 57-78.",
        "[25]" : "J. A. White, J. T. Rubinstein, A. R. Kay, Trends Neurosci. 23, 131 (2000).",
        "[28]" : "K. M. Franks, T. J. Sejnowski, Bioessays 12, 1130 (2002).",
        "[32]" : "T. von der Twer, D. I. MacLeod, Network 12, 395 (2001).",
        "[34]" : "E. P. Simoncelli, B. A. Olshausen, Annu. Rev. Neurosci. 24, 1193 (2001).",
        "[36]" : "V. Balasubramanian, M. J. Berry, Network 13, 531 (2002).",
        "[38]" : "W. B. Levy, R. A. Baxter, Neural Comput. 8, 531 (1996).",
        "[41]" : "Z. F. Mainen, T. J. Sejnowski, Science 268, 1503 (1995).",
        "[45]" : "P. Fries, J. H. Reynolds, A. E. Rorie, R. Desimone, Science 291, 1560 (2001).",
        "[46]" : "B. Pesaran, J. S. Pezaris, M. Sahani, P. P. Mitra, R. A. Andersen, Nature Neurosci. 5, 805 (2002)."
      }
    },
    {
      "title" : "Distributed Hierarchical Processing in the Primate Cerebral Cortex",
      "phrases" : [
        "The original notion of hierarchical processing in the visual cortex was put forward by Hubel and Wiesel (1962, 1965) to account for a progressive increase in the complexity of physiological receptive field properties in the cat visual cortex. In particular, they suggested that a serial, feedforward scheme could account for the generation of simple cells from LGN inputs, and complex cells, in turn, from simple cells. Likewise, the properties of hypercomplex cells and even 'higher-order hypercomplex cells' were attributed to inputs from their immediate predecessors.",
        "Our analysis will emphasize that, on the one hand, there is considerable segregation of information flowthroughout the visual pathway; on the other hand, there is also substantial intermixing and cross talk between streams at successive stages of processing.It is likely that these complexities in the anatomical circuitry reflect the multiplicity of computational strategies needed for efficient visual function (DeYoe and Van Essen, 1988).",
        "The demarcation of areal boundaries on the cortical map involved several stages. As noted, a few visual areas were explicitly identified by architectonic criteria in the hemisphere from which the map was made, and the locations of several additional areas were constrained by the pattern of interhemispheric connections that had been determined in this hemisphere.",
        "Connectivity analysis relies on finding a characteristic pattern of inputs and outputs for each cortical area.",
        "Architectonicstelies on a distinctive structure as seen in Nissl, myelin, or other staining techniques. It offers a reliable approach for only a minority of the areas listed in Table 1 and was used to map 3 of the areas (VI, V3, and MT)",
        "In practice, however, the dentification of most areas is based only on a subset f these approaches, often just 1 or 2",
        "To provide a physical perspective for these numbers, it is useful to note that the visual cortex as a whole has about the same surface area as a medium-sized cookie (about 8 cm diameter), while the entire cerebral cortex in one hemisphere corresponds to a large cookie (about 12 cm diameter).",
        "It is apparent that each visual area has many inputs and outputs. Moreover, the particular pattern of connections is distinctive for each area, in terms of the overall constellation of inputs and outputs. In most cases, this pattern provides a characteristic 'fingerprint' that can uniquely distinguish one area from all others. This is particularly true for areas whose connections have been thoroughly studied, such as those in the occipital lobe. Many areas, particularly the recently defined ones, have yet to be studied in detail; hence, our description of the connectional pattern is surely far from complete.",
        "The possibility that the visual cortex might operate by a strictly serial processing scheme can be ruled out just from knowing the multiplicity of connections per area and the near ubiquity of reciprocal connec tions. On the other hand, it seems highly unlikely that the visual cortex is a network that altogether lacks any distinction between processing levels. Many studies, both electrophysiological and lesion based, indicate that some visual areas, such as those in the temporal and parietal lobes, are involved in a higher level of information processing than that mediated by occipital areas such as VI and V2",
        "One hypothesisis that cortical areas are hierarchically organized in some very well-defined sense, with each area occupying a specific position in relationship to all other areas, but with more than 1 area allowed to occupy a given hierarchical level. Another possibility is that a hierarchy exists only in a loose sense, for instance, at the level of the different cerebral lobes, but not in any precisely definable manner for individual cortical areas.",
        "Distinguishing among such possibilities can be pivotal for understanding the operation of any complex system, whether it be in the domain of the cerebral cortex or of human society. It is worth noting in general terms that information flow in a hierarchical system (1) can go in both directions (upwards and downwards), (2) can skip over intermediate levels to go directly from a low to a high level, and (3) can travel in parallel through multiple, functionally distinct channels.",
        "Current ideas about hierarchical organization in the primate visual system were spurred by notions of forward and feedback pathways suggested by connectivity patterns. In particular, Rockland and Pandya (1979) noted that projections in one direction tend to originate from superficial layers and terminate in layer 4, whereas those directed in the opposite direction tend to arise from deep as well as superficial layers and to terminate outside layer 4. They suggested that these 2 directions might correspond to forward and feedback directions of information flow. Subsequently, this notion was used as a basis for proposing an explicit, anatomically based hierarchy of visual cortical areas (Maunsell and Van Essen, 1983).",
        "However, there are a few significant differences that merit explicit mention. Our new version differs from the Van Essen (1985) scheme in having area 7a moved 1 step higher and area DP 1 step lower.",
        "The red lines in Figure 4 indicate the 33 linkages having one or another of the hierarchical irregularities discussed in connection with Table 6. Their presence raises the issue of whether the cortex is inherently only a ''quasi-hierarchical'' structure that contains a significant number (perhaps 10%) of bona fide irregularities and exceptions to any set of criteria that can be devised. Alternatively, the visual cortex might contain an essentially perfect anatomical hierarchy that has been imperfectly studied using inherently ''noisy'' methods of anatomical analysis. Either interpretation is an interesting one, in our opinion, but we doubt that it is possible to obtain a clear-cut answer on the basis of currently available data.",
        "It is very likely that at least a few of the laminar and hierarchical assignments cited in our analysis will change when additional experimental data become available",
        "If one suspects that the underlying biology is extremely orderly, one would predia that the apparent discrepancies listed in Table 6 will largely disappear upon careful",
        "reexamination, thereby improving the overall fit to the hierarchy. This might be accompanied by changes in some of the specific hierarchical assignments. If, on the other hand, one suspects that a hierarchical relationship merely reflects a strong statistical bias, the prediction would be that an increasing number of unambiguous inconsistencies with our scheme will be found.",
        "In terms of connectivity, the great majority of areas that adjoin one another are directly and reciprocally interconnected. There are only a few clear-cut exceptions, such as the reported lack of a connection between ventral area V2 and adjoining areas TF and TH. Thus, while many pathways connect areas that are widely separated within the cortex, it is rare to see adjoining areas that fail to communicate directly with one another.",
        "so we regard the 'anterior signifies upwards' trend to be genuine and perhaps of significance with regard to the way in which the number of visual areas has increased during evolution.",
        "One of these is somatosensory area 7b, which is connected to areas MSTd and MSTp (Andersen et al., 1990) in a way that places it at the eighth hierarchical level. This allows us to link the visual hierarchy with a somatosensory hierarchy that will be discussed below.",
        "The great majority of pathways fit cleanly into ascending, descending, and lateral connections according to the same criteria used for the visual cortex.",
        "Remarkably, the 9 levels of the somatosensorymotor hierarchy are nearly as many as the 10 levels of the visual hierarchy, even though there are fewer than half the number of areas involved.",
        "As already noted, the pathways between the somatosensory and visual systems allow the different modalities to be linked into a unified sensorimotor hierarchy. The configuration of this unified hierarchy can be inferred from examination of Figures 4 and 7 together, but it can also be visualized directly, in a manner that we have illustrated elsewhere (Van Essen etal., 1991). For the most part, each level in the visual system can be matched to a corresponding level in the somatosensory-motor system, and vice versa. This is not invariably the case, however, because area 36 is 3 levels above areas 7a and 7b in Figure 7 but only 2 levels above them in Figure 4. This suggests that one of the intervening somatosensory-motor levels lacks a corresponding visual level, assuming that these hierarchical assignments are indeed all correct.",
        "It is also important to have more information on the linkage between auditory and visual systems. It is known that there are auditory projections to the polysensory, but predominantly visual-association area STP",
        "The remaining regions of the neocortex yet to be incorporated into our analysis include much of the frontal lobe (orbitofrontal, lateral prefrontal, dorsal prefrontal, and medial prefrontal), as well as cingulate, retrosplenial, and insular regions. Many of these regions have strong interconnections with areas near the top of the visual hierarchy, including areas 46 and 7a, and with somatosensory areas, as well",
        "One striking finding is that large paired injections centered in areas 7a and 46 led to interdigitating columnar patterns of terminations in some regions (e.g., cingulate cortex and orbitofrontal cortex), even though the same injections contributed to complementary (ascending and descending) patterns in other regions, such as the STS (Selemon and Goldman-Rakic, 1988). If this observation is confirmed using small tracer injections clearly confined to single cortical areas, it would indicate a clear breakdown in hierarchical relationships.",
        "Thus, there is a strong possibility that substantial portions of frontal and cingulate cortex lie outside the hierarchical framework proposed here for sensory and motor areas.",
        "In summary, a strategy based on laminar connectivity patterns, particularly in the anterograde direction, provides a rational and objective basis for systematically assessing hierarchical relationships throughout the mammalian neocortex. With appropriate refinements in the criteria for distinguishing forward and feedback connections, we have shown that this hierarchy encompasses the full extent of primate visual and somatosensory-motor cortex. However, much remains to be done in order to resolve the modest number of apparent discrepancies and to ascertain just how generally this hypothesis applies across systems and species.",
        "One of the striking features of the visual hierarchy is the extensive degree of parallel processing, as manifested by the presence of many areas at each level in the middle portion of the hierarchy (6 areas at level 5, 7 areas at level 7, and 5 areas at level 8 in Fig. 4). This contrasts sharply with the presence of only 1 or 2 areas at most levels in the somatosensory-motor hierarchy (Fig. 4 vs. Fig. 7).",
        "Malpeli et al. (1981) used reversible inactivation of specific LGN layers to show that about VS of the cells in VI can be activated independently through either the M or the P pathway.",
        "A comparable degree of cross talk persists in the ascending projections leading to the parietal and inferotemporal lobes. V4 projects most strongly to inferotemporal areas, but it also has substantial projections to parietal cortex, directly to VIP and LIP and indirectly through DP, MST, MST1, and MT. Likewise, MT projects heavily to the parietal cortex (directly to VIP and indirectly via MSTd and MST1), but it also has indirect connections with inferotemporal areas via FST and V4. There are also direct connections between parietal and inferotemporal areas (LIP-PITv and 7a-AITd), as well as indirect linkages by way of FST, STP, and frontal lobe areas.",
        "We have concentrated in this study primarily on an anatomical analysis that suggests 5 key principles of primate cortical organization: (1) a large number of visual areas, (2) highly distributed connectivity among areas, (3) reciprocity of connections, (4) hierarchical organization, and (5) distinct, yet intertwined, processing streams.",
        "Whether each level of the hierarchy represents a distinct stage of information processing is a separate issue that must be addressed mainly by physiological and behavioral approaches.",
        "One type of physiological evidence in support of the hierarchy comes from comparisons of receptive field size, as conventionally plotted using moving bars or edges (the 'classical' receptive field). In VI, receptive fields are typically very small, and they increase progressively at successive stages of the hierarchy, ultimately approaching the entire visual field in extent in some of the inferotemporal and parietal areas (cf. Van Essen, 1985, for references). Ideally, one would like to know whether these increases occur in stepwise fashion at each hierarchical stage. However, such information is not readily attainable, given that several factors contribute to differences in receptive field size, including a strong dependence on eccentricity, plus effects of anesthesia and of interanimal variability.",
        "emergent receptive field properties at progressively higher levels of the hierarchy.",
        "(1) Many cells in V2, but not in VI, are responsive to patterns that elicit percepts of subjective contours in human observers (Peterhans and von der Heydt, 1989; von der Heydt and Peterhans, 1989). (2) Some cells in MT, but not in VI, are selective for the motion of a complex pattern rather than the individual oriented components (Movshon et al., 1986). (3) Some cells in the inferotemporal cortex are selective for faces or other complex patterns (Desimone et al., 1984; Baylis et al., 1987; Perrett et al., 1987; Saito et al., 1987).",
        "Physiological distinctions between processing streams are evident from the outset, in that M and P channels differ markedly in how they represent information information along spatial, temporal, and spectral dimensions (cf. Shapley and Perry, 1986; Lennie et al., 1990). At any given eccentricity, P cells, on average, have smaller receptive fields and higher spatial resolution, whereas M cells have higher temporal resolution, higher contrast sensitivity, and a lower absolute threshold.",
        "These differences suggest an overall strategy in which the M and P channels handle distinct, but partially overlapping, portions of an information space that includes the dimensions of space, time, and spectral composition (Van Essen and Anderson, 1990).",
        "In a more general sense, there appears to be a complex, but orderly, relationship between low-level sensory cues (e.g., orientation, velocity, disparity, and spectral composition), high-level aspects of perception (e.g., perception of shape, surface qualities, and spatial relationships), and the processing streams that generate one from the other (DeYoe and Van Essen, 1988)."
      ]
    },
    {
      "title" : "The log-dynamic brain: how skewed distributions affect network operations",
      "phrases" : {
        "Introduction" : [
          "However, recent advances, which are summarized in this Review, suggest that such simplification is no longer tenable because the majority of interactions in highly interconnected systems, especially in biological systems, are multiplicative and synergistic rather than additive.",
          "Perhaps the best-known skewed distribution in neuroscience is the Weber–Fechner law, which postulates that the response to a sensory stimulus, such as light or sound, is proportional to the logarithm of the stimulus amplitude (4,5).",
          "A random variable that is the sum of many independent variables has an approximate normal distribution (as stated in the central limit theorem). Likewise, a random variable that is the multiplicative product of many independent variables has an approximate lognormal distribution (this is justified by the central limit theorem in the log domain).",
          "However, a lognormal distribution has a finite mean and variance, in contrast to power low distribution of scale-free systems. Distinguishing lognormal and power law distributions is important for understanding their biological origin.",
          "The goal of this Review is to show that skewed distributions of anatomical and physiological features permeate nearly every level of brain organization.",
          "An important consequence of the skewed distribution of brain resources is that a selected minority (say “10 percent”) of neurons can effectively deal with most situations (by which we mean brain states and environmental (place) changes but also context and other manipulations, such as novelty). However, to achieve 100% accuracy 100% of the time requires a very large fraction of brain networks to cooperate.",
          "Brain oscillations as expressed by scalp EEG at the macroscopic level, and the activity of neuronal networks as reflected by the local field potential (LFP)11 at the mesoscopic level form a system that spans several orders of magnitude of time12,13 (FIG. 1a). They are coupled in a hierarchical manner, in which the power of a faster oscillation is modulated by the phase of a slow oscillator12,14–16.",
          "The firing rates of principal cells of every region in the cerebral cortex investigated to date have a lognormal or lognormal-like rate distribution",
          "However, it may be argued that such distributions are an artefact due to methodological issues; indeed, each recording technique has some caveat.",
          "During global remapping, there seems to be a relatively ‘orthogonal’ or randomsample relationship between population firing-rate vectors in the different contexts, such that a minority of neurons discharge at comparable rates in both contexts, whereas the remaining neurons are relatively silent in one context and active in another39,42.",
          "Furthermore, the log firing rates of individual neurons during slow-wave sleep in the home cage and those during subsequent exploration in a novel environment show a reliable positive correlation",
          "The preserved rate correlations across states, testing environments and even novel experiences, suggest that the firing-rate distribution in cortical populations is relatively ‘fixed’ when longer timescales are considered and are more strongly controlled by factors intrinsic to internal network dynamics than by transient external factors.",
          "The relatively stable rate dynamics of cortical neurons raise several questions: how do such stable networks encode information? Do neurons at the opposite ends of the distribution have different intrinsic biophysical properties and wiring patterns (discussed in the next section)? And can slow-firing neurons become fast ones, or vice versa?",
          "Numerous indices of hippocampal place cell firing — such as within-session stability, place field coherence and information rate — are positively correlated with firing rates19, suggesting that fast-firing principal neurons are more stable and convey information more reliably than slow-firing neurons.",
          "Imaging place cells over several weeks and months has demonstrated that the place fields of ~20% of the population remain stable over that period, whereas the remaining ~80% may lose their place features56. Although firing rates were not reported in these long-term experiments, one can assume that the ‘place-stable’ neurons belong mostly to the fast-firing minority as there is a reliable relationship between rate, bursting and calcium influx57.",
          "Even if we assume that the axon arbors and synaptic contact probabilities with downstream neurons are similar for fastfiring and slow-firing neurons, the fast-firing minority (which also bursts more) may have a larger effect than the slow-firing majority because faster-firing cells can contribute more spikes in a given time window than can slow-firing neurons.",
          "Both in vitro and in vivo experiments have shown that bursts of spikes affecting the same synapse within <10 ms are often more effective than larger numbers of inputs on different dendrites of the same neuron30,58.",
          "suggesting that the fast-firing minority may form a special, highly active subnetwork or ‘hub’.",
          "It is important to note that although stronger connections among small groups of neurons may be associated with faster firing rates, model networks of either random or complex synaptic connectivity can give rise to a skewed, long-tailed distribution of firing rates63–68.",
          "Thus, stronger synapses are not only stronger on average but are also more reliably strong from event to event. Recent computational studies suggest that a skewed distribution of synaptic strengths between participating neurons may be a critical factor in sustaining lognormal firing rate distribution68,76",
          "In these studies, a few large-amplitude and stable synaptic connections seemed to dominate the entire model network because removal of the weak synapses had little impact on population firing, and when all synapses were equalized to a ‘mean’ strength, a much larger number of neurons had to be stimulated by external inputs to maintain stable activity68. Thus, the bulk of the information flow may be routed primarily through a web of strongly connected neurons.",
          "The efficacy of spike transmission is highly variable across pairs of cortical neurons and has a skewed, lognormal-like distribution — the majority of pairs are weakly coupled and a small minority are strongly coupled19",
          "However, when STDP works in a synaptic weight-dependent manner (called log-STDP83), it can produce a skewed weight distribution and sustain stable network dynamics83.",
          "Whether the postulated log-STDP rule is operative in the brain remains to be demonstrated.",
          "It is noteworthy that these structural–functional features may not be exclusive properties of cortical circuits: motor unit sizes in the spinal cord also show a lognormal pattern93",
          "Thus, it is possible that specific constellations of interneuron innervation of single principal cells may also contribute to variations in the firing rate of pyramidal cells.",
          "a minority of strong afferents are mixed with large numbers of weak inputs, so that the connectivity profile of the area is best described by a lognormal distribution100. These findings in monkeys also apply to the mouse brain",
          "Furthermore, the findings support the view that lognormal rules of connectivity can combine the advantages of local computation and global (top-down) control, synchronization, wiring economy, information storage and communication speed2,68,103,104. These new anatomical observations, therefore, are highly relevant to the often-discussed multimodal and multisensory neurons in various parts of the brain and to the computation of multisensory integration105.",
          "The macroscopic connectivity scheme can also provide clues about the relationship between the skewed firing-rate distributions and local–global communication: although fast-firing neurons with strong connections in a given circuit can respond effectively in most situations, the slow-firing neurons of the global connectome could be equally important. The global or ‘contextual’ activity provided by slow-firing neurons may constrain the effectiveness of ‘specific’ communication.",
          "In conclusion, it seems that the lognormal rule applies to various functions, from local circuits to systems of the brain connectome. Larger-diameter axons can provide faster communication, have larger terminal arbors112 and typically originate from neurons with high firing rates113. It is thus tempting to speculate that the skewed distribution of cortical connections forms the morphological substrate for the log rule of macroscopic brain dynamics, as reflected by the LFP and EEG.",
          "The experimental data reviewed above demonstrate that synaptic strength, neuronal firing rate, population synchrony and information content of spikes show a skewed distribution, and this is associated with a lognormal distribution of spine size and connections at the large-scale level of the brain connectome.",
          "What makes these distributions potentially important is not so much the fact that skewed distributions are found at multiple levels but that these skewed distributions might be linked across the multiple levels. Neuronal firing patterns in numerous cortical areas in various species show a common theme: a small minority of strong synapses and fast-firing neurons provide a substantial portion of the activity in all brain states and situations, and information may spread along the trajectories of these strongly connected and highly active neurons. However, the rest of the brain is not silent; the remaining part of neuronal activity in any given time window is supplied by very large numbers of weak synapses and slow-firing cells. The divisions ‘strong’ and ‘weak’, and ‘fast’ and ‘slow’ are not absolute, as a continuous — rather than bimodal — distribution characterizes both brain activity and its supporting anatomical structure.",
          "A lognormal distribution may be the result of a combination of genetically defined ‘scaffolding’ and experiencedependent modification of synaptic strengths, biophysical properties and anatomical wiring; and the quantitative features of the lognormal distributions of several measures of neural activity and connectivity may differ across cortical areas, layers and neuron types.",
          "Importantly, despite a degree of rigidity in terms of network statistics and structure, members of the slow-firing majority of neurons, which have more-plastic properties, can provide sufficient flexibility for dynamic neural coding.",
          "A theoretical implication of the skewed distribution pattern is that the distinction between signal and noise inevitably becomes fuzzy. Synapses and neurons at the left and right tails of the distributions may seem to serve different functions, but there is no clear boundary between their postulated functions. A practical implication of the absence of a clear boundary is that comparing morphological and dynamic variables (for example, firing rate) with Gaussian distribution-based statistics is not justifiable.",
          "The problem of proper sampling of the weak majority (that is, the left tail of the lognormal distribution) is a general issue and may contribute to the appearance of power laws in many models",
          "What is the relationship between the two ends of a continuous distribution that can span several orders of magnitude? A highly active and bursting minority of neurons, potentially supported by strong synapses in a preferentially connected subnetwork, may be responsible for nearly half of the spikes in any time window. his end of the distribution may serve to provide fast, economic and highly efficient but perhaps less-precise communication12,104",
          "Although this is currently a speculative idea, such high-firing and strongly connected neurons with faster-conducting axons may support a ‘rich-club’ organization in the brain, in which a minority of neurons, with stronger connectivity, have access to more information than the majority of neurons and share such information among themselves116",
          "As there is no definable boundary between the two ends of the distribution, the boundary between local and global connectivity117,118 is vague. In networks with such local–global interactions, optimal performance is characterized by a trade-off between computation speed and accuracy.",
          "A common observation is that the activity of just a dozen or so strongly firing neurons is often more informative about an animal’s behaviour than that of the remaining majority of neurons that is being recorded simultaneously28,30,121–123. Similarly, in brain–machine interface applications, just 10–20% of task-related neurons can predict as much as 60–80% accuracy of limb position or gripping force, and adding further information from the remaining majority of taskrelated neurons improves the prediction only by a modest 10–15%124,125. Thus, it seems that a ‘backbone’ consisting of the fast-firing minority of neurons in a strongly connected network provides a ‘best guess’ for matching behaviour to environmental situations.",
          "The large quantity of weak synapses may also represent a reservoir for memory storage. In addition, the slow-firing majority of neurons may serve to provide excitation to interneurons and thereby secure a sufficient level of inhibition to counter the effects of the fast-firing minority of excitatory neurons115 and maintain self-organized, sustained activity in the cerebral cortex.",
          "Networks with skewed statistical properties have been shown both to provide a broad dynamic range and to offer stability, resilience and tolerance to component failures68,75,127. Another major advantage of logarithmically linear computation in both electronic circuits and biochemical systems is its energy efficiency128,129, and this efficacy probably applies to brain circuits as well.",
          "Another fundamental feature of cortical circuits is feedforward inhibition130, and numerous experiments suggest that division is accomplished by dendritic subtraction of excitatory and inhibitory inputs that are encoded logarithmically, followed by exponentiation through active membrane conductances67,76,131–136.",
          "Even a non-experienced brain can have numerous high-probability states (often referred to as attractors140) that can give rise to distinct constellations of neuronal firing (so-called ‘trajectories’ (REFS 121,141)), each of which is available to represent a unique event or situation119",
          "Each situation — novel or familiar — activates the appropriate highest-probability state, and this matching process reflects the ‘best guess’ of the brain. From this perspective, there is no ‘unknown’, as every situation is able to activate one of the pre-existing trajectories on the basis of generalization from past experience. Such preconfigured connectivity and firing patterns, which are initially driven by the strongly connected and fast-firing minority of neurons, may explain why the spatiotemporal structures of spontaneous and evoked activity are often similar46–48,78–81 and why spontaneous activity can be predictive of activity evoked by an experience even when the experience is novel (a phenomenon known as preplay)19,45",
          "However, the large reservoir of the weakly connected majority of neurons lends itself to modifications, and as a result of these modifications, initially similar trajectories may become distinct from each other. From this perspective, learning and experience are largely a fast-matching and slower refinement process.",
          "In summary, the brain can generate a large number of states that can determine the spatiotemporal evolution of neuronal activity. Experience becomes embedded into these pre-existing states (attractors) and modifies them with repetition so that the attractor states acquire ‘meaning’ by representing external inputs and events81,145.",
          "In summary, although ‘10%’ of highly active neurons can provide remarkable solutions in most encounters, optimal performance requires the commitment of a very large fraction of the brain through a very low level of engagement. A full understanding of the origin and biological utility of the multiscale, log-dynamic organization of brain function requires systematic work at the experimental, modelling and theoretical fronts. Perhaps the biggest challenge is to reveal how the lognormal form of connectivity and firing dynamics relates to the log scaling of the hierarchical nesting of multiplexed brain rhythms148 and to the Weber–Fechner law of our senses."
        ]
      },
      "cites" : {
        "[4]" : "Weber, H. De Pulsa Resorptione Auditu et Tactu. Annotationes Anatomicae et Physiologicae (Koehler, 1834) (in German).",
        "[5]" : "Fechner, G. T. Elemente der Psychophysik (Breitkopf und Härtel, 1860) (in German).",
        "[83]" : "Gilson, M. & Fukai, T. Stability versus neuronal specialization for STDP: long-tail weight distributions solve the dilemma. PLoS ONE. 6, e25339 (2011).",
        "[129]" : "Daniel, R., Rubens, J. R., Sarpeshkar, R. & Lu, T. K. Synthetic analog computation in living cells. Nature 497, 619–623 (2013).",
        "[131]" : "Koch, C. & Poggio, T. in Single Neuron Computation (eds McKenna, T. M., Davis, J. L. & Zornetzer, S. F.) 315–345 (Academic, 1992).",
        "[133]" : "Gabbiani, F., Krapp, H. G., Koch, C. & Laurent, G. Multiplicative computation in a visual neuron sensitive to looming. Nature 420, 320–324 (2002).",
        "[134]" : "Silver, R. A. Neuronal arithmetic. Nature Rev. Neurosci. 11 , 474–489 (2010)."
      }
    },
    {
      "title" : "Circuit complexity and axon wiring economy of cortical interneurons",
      "phrases" : {
        "Introduction" : [
          "The mammalian cortex consists of two basic neuron types: excitatory principal cells and inhibitory interneurons.",
          "This article considers how wiring of interneurons affects their contribution to network performance and suggests that connectivity is a useful approach for examining how complex functions (e.g. oscillations) emerge from elementary features (e.g. inhibition) [8].",
          "By contrast, cortical structures have evolved in a manner that most closely resembles a relatively sparsely connected network of few principal cell types and many classes of GABAergic interneurons.",
          "One hypothesis is that the diversity of interneurons in the mammalian cortex [1–7] reflects a compromise between computational needs and wiring economy [10,18].",
          "if p(i,j ) decreases with d(i,j ) as a power law, p(i,j ) , d(i,j )2a, then there is a significant (although small) probability for connections across long distances, especially if the exponent a is small so that p(i,j ) falls off slowly with d(i,j ), and a small world becomes realizable.",
          "Examples of how interneurons implement novel functions in the brain include sculpting stimulus selectivity of cortical neurons in sensory and memory systems [20,21] or generating coherent oscillations at different frequencies [22].",
          "Given the hypothesis that diversity reflects a compromise between computational needs and wiring economy, we need to discover the rules that can describe how interneuron diversity and connectivity result in economical computational complexity."
        ],
        "Scalable interneuronal clocks: connectivity is of the essence" : [
          "Complex brains have developed specialized mechanisms for keeping time: inhibitory interneuron networks",
          "Oscillatory timing can transform unconnected principal cell groups into temporal coalitions, providing maximal flexibility and economic use of their spikes [24].",
          "Therefore, long-range network synchrony can be achieved with a small fraction of the local connectivity being replaced by long-range connections yet keeping the total wire length at a minimum (Figure 3d).",
          "These simulations support the hypothesis that an effective design for network synchronization with a minimal wire-cost can be achieved by the division of labor between a larger population of local and a small subpopulation of long-range interneurons. This architecture is of a class called ‘smallworld’ networks",
          "However, cortical networks support multiple, coupled oscillations at various temporal scales [22] and numerous other functions [2], which require more interneuron types and economic wiring."
        ],
        "Functional diversity of interneurons increases computational power at a low wiring cost" :[
          "As already discussed, integrating functionally novel types of neurons into networks increases their computational diversity [12,13].",
          "In terms of their connectivity to the principal cells [2,5,13,44], three major groups of cortical interneurons are recognized: (i) interneurons controlling principal cell output (by perisomatic inhibition), (ii) interneurons controlling the principal cell input (by dendritic inhibition) and (iii) long-range interneurons coordinating interneuron assemblies.",
          "The hierarchy of interneuron organization shares some important features with systems characterized by smallworld architecture [14] and/or the power law [13]",
          "According to this hypothesis, the most numerous interneurons belong to the perisomatic control group, followed by the specific (single) and less-specific (multiple) dendritic control groups, and the least numerous cells are the long-range interneurons",
          "The slope of this hypothesized relationship should vary with network size. With increasing brain size, the number of interneurons with local connections increases more rapidly than neurons with more extensive spatial coverage.",
          "Accordingly, the ratio of interneurons with local and distant connections (i.e. the slope of the power law function in Figure 5) should be much larger in the rodent neocortex than in the rodent hippocampus, and orders of magnitude larger in the human brain than in the rodent cortex, for achieving the same magnitude of global synchrony",
          "Support for the postulated hierarchical organization of interneurons comes from functional observations in the intact hippocampus."
        ],
        "Concluding remarks" : [
          "This review has considered whether, and how, the diversity of cortical interneurons reflects optimization between computational performance of the cortex and its axonal wiring costs.",
          "The number of neurons in the divisions shows an inverse relationship with spatial coverage, a relationship that suggests some mathematic ally definable organization. The connectivity-based classi fication is supported by the distinct physiological patterns of class members in the intact brain.",
          "It is unlikely that static models, such as small-world or scalefree graphs, can faithfully describe the neuronal networks with evolutionary goals. Nevertheless, they illustrate the important point that costly distant connections can be minimized by appropriate clustering architecture."
        ]
      }
    },
    {
      "title" : "Information Processing in the Primate Visual System: An Integrated Systems Perspective",
      "phrases" : {
        "Introduction" : [
          "The results of these ongoing analyses must be appropriately routed to brain regions involved in perception, motor control, and planning.",
          "The neurobiological approach provides a detailed anatomical and physiological description of the visual system and suggests a number of key principles, including modular design, hierarchical organization, and the presence of distinct but intertwined processing streams",
          "It emphasizes the need for computationally sound models that are grounded in basic principles of signal processing and respect both the power and the limitations of the underlying neural circui"
        ],
        "Anatomical Overview" : [
          "The major retinal output goes via the lateral geniculate nucleus (LGN) to the striate cortex (area VI) and from there to a mosaic of extrastriate cortical visual areas shown in various colors in Fig. 1. Thirty-two distinct cortical areas associated with visual processing have been described on the basis of anatomical, physiological, and behavioral information (1, 2).",
          "To date, 305 pathways interconnecting the 32 cortical visual areas have been identified with modern pathwaytracing techniques (1). This constitutes nearly one-third of the number there would be if the network were fully interconnected. Hierarchical relations between areas have been assessed by the use of information about the cortical layers in which pathways originate and terminate (1, 4)",
          "ystematic application of these criteria leads to a hierarchy containing ten levels of cortical visual processing plus several additional stages of subcortical processing (Fig. 2). The visual hierarchy is extensively linked to centers associated with motor control, other sensory modalities, and cognitive processing (1, 5),",
          "ms. Two major processing streams originate within the retina. About 80% of retinal ganglion cells are parvocellular (P) cells projecting to the P layers of the LGN, whereas 10% are magnocellular (M) ganglion cells projecting to the M layers of the LGN (8).",
          "n VI and V2, these are reorganized into a tripartite arrangement (7), the so-called P-B, P-I, and M streams (6",
          "In V1 the compartments are patchy and specific to particular cortical layers, whereas in V2 they form stripes parallel to the surface and extending through all layers (7,",
          "Additional areas associated with the M stream include V3, MT, MST, and some posterior parietal areas",
          "The P-B and P-I streams include separate subregions of V4, and this segregation may persist into inferotemporal (IT) areas (5, 10). Despite the specificity of connections within each stream, substantial cross talk occurs at many levels, as demonstrated anatomically (1, 6) and physiologically (11)."
        ],
        "Information processing strategies" : {
          "Information bottlenecks and scale invariance" :[
            "Within this anatomical framework, it is important to understand how visual information is represented by individual neurons, how it is transformed and discarded at successive levels, how it is distributed among different processing streams, and how it contributes to the performance of specific visual tasks",
          "Information bottlenecks and scale invariance. Physical images on the retina contain far more information than can be efficiently handled by the brain. An initial stage of data reduction occurs in the retina, where the nonuniform distribution of -IO ganglion cells leads to a variable resolution representation that is approximately scaleinvariant (12, 13)",
          "To illustrate the significance of scale invariance, imagine looking at a colleague's face across a table and fixating on the tip of her nose. Resolution is very high at the fixation point (-104 pixels per degree squared) but declines sharply at progressively more peripheral locations. If the friend moves closer (whil, SUPERINTERESTING, FIND PAPER)"
          ],
          "Filters, not feature detectors" : [
            "Transmitting the difference between a central value and the local mean luminance is an effective data reduction step; for natural images it increases the statistical independence of activity in neighboring cells (that is, decreases their correlation).,",
          "The primary role of P cells is to encode information about luminance contrast. They respond to low and moderate temporal frequencies (mainly 1 to 20 Hz) over the full range of spatial frequencies visible at a given eccentricity (14, 15)",
          "M cells are optimized for higher temporal frequencies (mainly 5 to 40 Hz), but they provide only about one-third the spatial resolution because of their lower sampling density",
          "Thus, the P and M systems cover partially overlapping regions of the spatiotemporal information space illustrated at the bottom of Fig. 3 (12, 14-16",
          "17). Like the P system, the M system also conveys a second type of information: many M cells have nonlinearities that encode the presence of fine-grained details, without representing precise spatial relations (that is, phase information) (14, 15, 18).",
          "A unifying descriptive framework (on the basis of cat and monkey studies) is that cortical receptive fields are oriented in both spatial (x-y) and space-time (x-t) coordinates",
          "Spatial orientation gives rise to conventional orientation selectivity for elongated stimuli and to sharpened spatial frequency tuning, whereas spatiotemporal orientation gives rise to velocity tuning (19).",
          "imple cells act as quasilinear filters (20) and are analogous to the filters in wavelet representations, whose sensitivity profiles are restricted in both space and spatial frequency. Wavelet representations have become popular in image processing because they provide a statistically independent and complete visual reprsentation (21).",
          "Complex cells have pronounced spatial nonlinearities and provide a measure of image power within a restricted range of orientations, spatial and temporal frequencies, and space (22).",
          "Like the subpopulation of nonlinear M cells in the retina, complex cells convey information about the statistics of images (for example, texture and 'motion energy'), while discarding information about spatial details. This may help, for example, in distinguishing the roughness of a rocky terrain without the need for pebble-by-pebble scrutiny; such strategies have important applications in image processing (2",
          "This perspective differs from the notion promoted by 'feature detector' advocates (24) that early cortical processing is mainly devoted to the explicit detection of features such as edges or zero-crossings of intensity derivatives. These are essentially logical, all-or-none decisions that are better postponed to later stages of analysis (25)."
          ],
          "Information divergence and convergence" : [
            "Two basic tasks of vision are object recognition (what it is) and the determination of spatial relationships among objects in a dynamic three-dimensional world (where it is, and where it is going)",
          "Corresponding to this functional distinction is an anatomical dichotomy: object recognition is selectively impaired by lesions of IT areas, whereas judgments of spatial relations are impaired by lesions of area 7a and other posterior parietal areas (26).",
          "However, ordinary visual tasks typically involve the coordinated use of several types of information. In this respect, it is reasonable that each processing stream is associated with two or more types of selectivity, rather than just one type (Fig. 3, middle row) (6, 7).",
          "Each stream has a distinctive constellation of selectivities, and at higher levels each stream contains cells that also have more complex receptive field nronerties sunrestive of intermediate staves of cortical nrocessing (2, 27).",
          "The specific characteristics of the M stream make it well suited for various tasks requiring motion information, but motion is not the only type of information it represents. The P-B stream is suited for tasks needing spectral information and the P-I stream for tasks needing detailed spatial information, but other types of information are multiplexed into these streams as well.",
          "To take advantage of the full spatiotemporal frequency spectrum transmitted by the optic nerve, higher levels of the visual system need access to information from both the P and the M systems during the performance of many tasks. The anatomical cross talk described above provides a neural substrate for this convergence, and results from selective lesion studies indeed indicate that either the P or the M system alone can mediate a wide range of tasks (for example, depth perception, speed, and direction discrimination) as long as stimuli are presented in the appropriate spatiotemporal range (16, 28)."
          ],
          "Dynamics aspects of information flow" : [
            "The recognition of complex patterns is too computationally demanding to be carried out at maximal resolution across the entire visual field",
            "However, the problem is manageable because pattern recognition occurs mainly within a restricted window of attention that can be rapidly shifted in position and changed in spatial scale",
            "Several lines of psychophysical evidence suggest that the window of attention has an effective spatial resolution about 20 to 30 sampling elements across, independent of shifts in position and scale (29).",
            "Because this is only -1% of the capacity of the optic nerve, it represents a major additional bottleneck in information flow.",
            "he model we prefer (12, 31) is based on selective gating of neural inputs that is coordinated across a series of processing stages, including areas Vl, V2, and V4, as well as IT. This model accounts for the preservation of information about detailed spatial relations within the window of attention, which we consider crucial to any comprehensive model of attention. It makes specific predictions about dynamic effects of attention on receptive field properties, which are supported by physiological recordings from V4 and IT of alert monkeys (32)"
          ],
          "Modularity and computational flexibility" : [
            "In considering how this principle might be reflected in the design of the brain, numerous engineering issues and trade-offs arise, just as in computer design (34).",
            "i) Creating separate modules for different subtasks allows neural architecture to be optimized for particular types of computation. It also allows different types of information to be represented explicitly, in ways that can simplify later stages of analysis. However, it is important to avoid overly specialized modules that lack flexibility, are rarely used, or are inordinately complex to construct.",
            "Replicating the same module many times over, as exemplified by the internal structure of Vl (35), allows stereotyped computations to be carried out massively in parallel. However, high-level tasks such as pattern recognition, which are computationally expensive and require large amounts of stored data, should not be duplicated unnecessarily.",
            "n principle, having both types of modularity offers great computational flexibility. However, to capitalize, it is critical to maintain coordinated and efficient routing of information between modules",
            "In a highly modular system, many important subtasks may involve functions (for example, controlling information flow) that are peculiar to the specific architecture of the system. These may appear obscure or arcane when analyzed only in terms of the inputs and outputs of the whole system. This suggests a need for caution in interpreting cortical function as a one-to-one mapping between individual visual areas or streams and the perceptions of color, form, or motion (7, 36).",
            "nstead, we emphasize a task-oriented perspective, keyed on understanding how overall tasks are broken into subtasks and on elucidating the computational strategies needed for their implementation (6)."
          ],
          "Conclusion" : [
            "The computations carried out within any given cortical area are anatomically constrained by its inputs and its intrinsic synaptic circuitr",
            "There may be a fundamental distinction between ascending pathways in the hierarchy, whose circuitry dictates the basic classes of analysis carried out within an area, and the modulatory influences exerted by feedback pathways from higher centers and perhaps by the pulvin",
            ". These modulatory influences may allow for several types of computational flexibility: adjusting the exact nature of the transformation carried out within an area; regulating the inputs on which the computation is made (input gating); or switching the targets to which the results are transmitted (output gating).",
            "ortex. Collectively, they may allow the brain to reorganize its computational structure adaptively, on a rapid (-100 ms) time scale, for optimal utilization of the incoming data and of the available neural resources",
            ". Translating this general hypothesis into specific, neurobiologically plausible models and into critical experimental tests will be a challenge for the futur"
          ]
        }
      }
    },
    {
      "title" : "‘Hierarchy’ in the organization of brain networks",
      "phrases" : {
        "The example of the visual cortical hierarchy" : [
          "A classic interpretation of ‘hierarchy’ that represents to many systems neuroscientists a fundamental version of the concept is the primate visual cortical hierarchy (VCH).",
          "the complexity of the wiring of the cerebral cortex, combined with a comforting approach for restoring order.",
          "it is frequently expected that response properties change systematically as one moves to higher-level areas within the scheme. In particular, receptive fields should become larger and the topographic (retinotopic) organization less pronounced, so that neurons at higher levels of the scheme respond to more global and complex image features, such as faces and complex motion features.",
          "cortical layers are classified as ‘backward’ [7] (figure 1c). The classification can be further extended and refined; specifically, by including categories for ‘lateral’ projections (which originate from upper and deep cortical layers in a more equal proportion and terminate in the target areas in a column-like fashion across all layers) [2].",
          "In fact, many (hundreds of thousands) different schemes can be built that all fulfill these constraints optimally, with a minimum number of (six) constraint violations [6,9].",
          "It is nonetheless interesting that this sorting of laminarspecific projections can be achieved nearly perfectly, with a very small number of violations, on the direction of the more than 300 projections. In addition, most of these violations may be plausibly resolved [6].",
          "The functional implications of this high-order scheme are not obvious, even if ignoring the principal indeterminacy of the sorting process.",
          "Specifically, it was found that the VCH scheme does not align well with functional properties of the visual system such as stimulus processing latencies, which are much more simultaneous than expected, in particular in the dorsal part of the visual system [14,15], or the presumed increasing complexity of functional responses of areas on different levels of the VCH [16–18].",
          "These findings were summed up by Zeki [19, p. 243] in the conclusion that ‘... perceptual hierarchy cannot be predicted from the anatomical hierarchy’ (i.e. the VCH), echoing the statement of Silvanto [20, p. 17] that ‘... anatomical hierarchy does not imply functional hierarchy’.",
          "Recent results also indicate that some of the pathways of visual information flow are not hierarchical, so that the anatomical hierarchy cannot be taken as a strict flowchart of visual information either."
        ],
        "The plan of the present paper" : [
          "and finally the interpretation of ‘hierarchy’ as an ordering of scales of connectivity, as in the case of multilevel modular networks."
        ],
        "Hierarchy as a topological projection sequence" : [
          "In this perspective, primate visual cortical areas are ordered by the number of steps by which they can be reached from sensory (specifically, visual) input, taking the shortest path via direct structural connections (cf. figure 2)",
          "Simply, this perspective only considers the direct area-to-area connections, but not their laminar patterns. Directionality in this kind of hierarchy arises from defining a start and end point, such as sensory input or motor output. If primate visual cortical areas are ordered by this sequential connectional topology, rather than by their direction as inferred from laminar patterns, two very different arrangements emerge (figure 3).",
          "Conspicuously, the arrangement by the number of connection steps from the retina results in a much more compressed scheme than the VCH. Intuitively, as the scheme takes into account the number of processing steps, it should correlate more closely with functional properties of the visual system, such as onset latencies, than the VCH.",
          "ndeed, computational modelling by populations of integrate-and-fire neurons has demonstrated that empirical onset latencies in the primate visual system can be reproduced nearly perfectly on the basis of the connectional topology of the cortical network, without attributing special roles to ‘forward’ and ‘backward’ projections [22].",
          "Thus, while the arrangement of the VCH does not help to predict stimulus processing latencies, the topological scheme does. It also appears to align better than the VCH with features such as the complexity of visual representations in different cortical areas, for instance, V2 and V4, which are more similar in their response properties than expected based on the clear separation of these areas in the VCH [16].",
          "The notion of a sequential organization of brain networks is potentially rooted in the image of the sensory-motor arc, the intuitive incremental processing sequence of sensory inputs eventually resulting in motor actions.",
          "However, several known aspects of brain network organization also appear incompatible with a clearly sequential arrangement. First, nodes in brain networks are very widely connected, ruling out a strict serial and sequential chain of signalling in which each node only possesses two connections (i.e. input and output). Moreover, these connections are not just formed with next (spatial or topological) neighbours. Second, shortest paths across brain networks are known to be quite short (e.g. [27]) also indicating the presence of shortcuts across networks, which increase the diversity of processing and reduce the sequential organization.",
          "For the formal analysis, the connections need to be embedded in some layout, for instance, simply along a one-dimensional axis. Then the nodes are rearranged until the cost is minimal, which can be achieved through an optimization approach.",
          "The minimal cost of the sequential layout of the actual data should also be compared to the layout cost for a network of the same size and density, but different topology, in order to place the organization of the networks on a relative scale.",
          "This finding means that visual cortical projections in the primate indeed possess a semi-sequential organization, even if they are not arranged in a strictly sequential way. The sequential arrangement (figure 4b) largely resembles the intuitively assumed sequence of the processing of sensory signals in the primate visual system, from primary and adjacent extrastriate areas on the left to dorsal stream and ventral stream areas towards the right. (This interpretation ignores outliers with few documented connections, such as areas VOT and V4t, which are moved to the periphery of the arrangement owing to the sequence optimization process.)"
        ],
        "Hierarchy as a gradient of features" : [
          "Another, frequently employed sense of hierarchy is that of a gradient of structural or functional features, that is, an orderly spatial progression of parameters which are changing systematically acrossthecorticalsheet.Anexampleisshowninfigure5a, where different macroscopic structural features, such as neuron density, and microscopic features, such as characterizations of layer 3 pyramidal neurons in terms of their size and spine parameters, are shown in the same cortical flat map (adapted from Markov et al. [31]).",
          "The figure confirms what has been known for a long time (e.g. [32]), that features such as cortical thickness or the neuron density of cortical areas are not distributed uniformly or randomly across the cortical sheet, but are found in systematic variations along spatially organized gradients.",
          "In particular, classic neuroanatomical studies by von Economo and Koskinas demonstrated that cortical areas can be categorized into distinct, ordinal cytoarchitectonic types [32,33]. Moreover, the cytoarchitectonic and myeloarchitectonic inhomogeneity that is observed in the cerebral cortex forms spatially ordered changes, that is, gradients",
          "Moreover, laminar patterns of projection origins are related to differences in architectonic differentiation. Connections between areas of distinct differentiation show a skewed unilaminar projection pattern, with projections originating predominantly in the infragranular or supragranular layers depending on the direction of the projection (agranular to eulaminate projections and eulaminate to agranular projections, respectively), while connections between areas of similar architectonic differentiation show a bilaminar projection origin pattern (connections between middle panels), where the dominating laminar compartment again depends on the connected areas’ relative differentiation.",
          "n summary, there are concurrent changes of macro- and microstructural cellular and connectional features across the cortical sheet, forming spatially ordered gradients, confirming and expanding observations from classic neuroanatomy studies (gradation principle of Sanides [29]). Figure adapted from [30].",
          "Importantly, recent observations [35–40], conjointly with classic studies [29,41], indicate that the spatially ordered changes of cortical features are concerted; that is, changes in multiple features, for instance, myeloarchitecture, cell density, spine density, and intrinsic connectivity, occur simultaneously along the same axis across the cortex.",
          "For instance, in the case of the structural features displayed in figure 5a,overall neuron density of primate cortical areas is anti-correlated with microscopic cellular features, such as the soma cross section of layer III pyramidal cells as well as their spine density and spine count.",
          "Indeed, recent work on cat and monkey cortex indicates that cytoarchitecture-based predictive models of laminar origin of connections consistently outperform other predictive models based on features, such as rostro-caudal distance [39,46,47]. Thus, cytoarchitectonic gradients of the cortex, as fundamentally characterized by neuron density, constitute the central axis around which shifts of the laminar origin of connections manifest [40].",
          "Thus, hierarchies based on the laminar origin of connections and hierarchies in the sense of spatially ordered features of cortical organization naturally align.",
          "In summary, a plethora of findings from classic and more recent studies imply that variations of cortical features on multiple levels of cortical organization, such as the genetic, cytological and connectional level, manifest as concerted changes along spatial axes [48]. Such concerted changes are aligned along a common spatial dimension spanning from less to more differentiated parts of the cortex, on average corresponding to a gradient from ‘limbic’ (agranular and dysgranular) cortices to primary, eulaminate cortices (e.g. primary visual cortex); thus, defining a natural axis of variation of cortical organization.",
          "Evidently, the systematic variations of cortical structure and function have ramifications for function. For instance, spine density gradients entail different levels of excitability of the neuronal populations. Indeed, a computational model embodying such density heterogeneity reveals different receptive time windows that correspond to the natural axis of the primate cerebral cortex [49] in line with empirical evidence [50].",
          "In addition, the natural axis of the concerted changes across the cortex entails a sensory to transmodal functional gradient, as classic organizational schemes [3] and more recent observations [51] indicate. Thus, instead of using ‘hierarchy’ to denote the spatially ordered, concerted variation of cortical features, a more neurobiologically concrete term, rooted in a large body of classic and recent studies in different mammalian species, would be a natural gradient or fundamental axis of the cerebral cortex."
        ],
        "Hierarchy as a progression of scales" : [
          "In the context of brain networks, where ‘nodes’ abstractly represent neural elements ranging from neurons to whole cortical areas or subcortical nuclei and ‘edges’ represent the structural or functional interactions of these elements [52], such scaling means that smaller network units are contained or encapsulated within larger ones. Several other features may scale in association with this encapsulation of network elements, such as spatial scales or time scales, or a variety of concrete functional features.",
          "Concentration of connections within modules allows locally sustained activity, while at the same time preventing global over-excitation of the networks, owing to the low density of inter-modular connections [53]. More generally, hierarchical modularity may be a natural way to balance network segregation and integration.",
          "An influential concept in network neuroscience has been that an optimal balance between these aspects reflects the complexity of network organization [57], maximizing the richness—measured by the entropy—of potential functional interactions.",
          "he hierarchical, multi-scale organization combines connectional sparsity at the global network level with network integration through connectivity that scales naturally from the local to the global level. Computational studies demonstrate that, both, increasing the number of modules or hierarchical levels increases the stability of self-sustained network activity [58].",
          "Simulations with excitable networks demonstrate that activity tends to die out quickly in small and dense networks, as nodes cannot recover their excitability before the next wave of activity arrives. By contrast, networks with a longer average cycle length, which may outlast inhibitory and refractory periods of the nodes and give them time to recover, might be better able to sustain activity patterns.",
          "Criticality, the positioning of a dynamical system at the boundary between order and irregular chaotic dynamic behaviour (or disorder) has for a long time been considered an advantageous configuration of biological systems.",
          "Critical points are linked to high adaptability, because small changes in an external control parameter can trigger large rearrangements in the internal system state. There is experimental evidence for such phenomena in the brain [61,62] and, intuitively, the normal working brain should be near the critical transition, because it operates between the extremes of complete order, in a silent brain, and the complete disorder of wildly propagating, unstructured activity.",
          "Criticality in the brain is particularly intriguing, because it can enhance the informationprocessing capabilities of neuronal networks and optimize the dynamic range as well as the input sensitivity of brain networks [63].",
          "In summary, the interpretation of ‘hierarchy’ as a scaling of structural and functional properties of the brain appears as a very powerful and general concept that needs to be more fully explored. Several further aspects of the brain show hierarchical scaling, such as the spatial encapsulation of smaller neural elements (e.g. ion channels, spines) in larger ones (i.e. neurons), the hierarchy of time scales and rhythms of the brain [67] as well as the level of access or control of brain networks (local versus global access, cf. figure 6). Finally, such a scaling may also concern the representational level, that is, the chosen ‘aperture’ (scope or focus) of empirical investigations or the complexity of models of neural properties, as in the gradual transition from detailed biophysical models to more abstract representations of neural properties in neural point models or neural masses [68]."
        ],
        "Hierarchy as a sorting of laminar projection patterns" : [
          "The difference is that cortical types are well-defined biological entities with a direct structural and functional interpretation (in terms of neuron density, spine count, branching of intrinsic connections, neurotransmitter receptor profiles, excitability, and so on), whereas the levels of the VCH are constructs derived indirectly from an (indeterminate) sorting process with no such clear interpretation.",
          "This conclusion does not contradict the fact that the VCH may be correlated with structural or functional features such as excitability of cortical areas [49]; however, a explanation for these features should not be sought in the VCH, but the underlying structural gradients of the cortex.",
          "More generally, as the basic presence or absence of connections is also linked to the architectonic similarity of primate cortical areas [30,40,43,69], there exists a natural relationship between the architectonic gradients of the cortex described in §3 and the sequential organization of cortical connections outlined in §2 above."
        ],
        "Conclusion" : [
          "As particularly demonstrated for the example of the non-human primate cortical visual system, these diverse ‘hierarchy’ concepts lead to different interpretations of the empirical data, with diverging functional implications.",
          "In summary, further meanings of the term ‘hierarchy’ may expand and enrich the existing list and we hope that this endeavour will further enhance the conceptual clarity that is needed for proper dissemination of ideas, results, models and theories among neuroscientists."
        ]
      }
    },
    {
      "title" : "Current concepts in neuroanatomical tracing",
      "phrases" : {
        "Dierent tracers for dierent purposes" : [ 
          "In particular, in vivo labelling with Øuorescent dyes allows not only the deÆnition of neuronal populations according to their anatomical connections, but also makes them readily accessible to a wide range of additional approaches.",
          "Multiple-labelling strategies using dierent Øuorescent dyes in vivo or in Æxed tissues to study divergent or convergent projections."
        ],
        "Historical perspective" : [
          "With regard to the direction of transport, it is possible to distinguish between the anterograde and retrograde transportation of tracer material.",
          "In terms of neuroanatomical tools, retrograde axonal transport allows identiÆcation of the cells of origin of aerent nerve Æbres to a particular target zone, while anterograde axonal transport enables the projection target(s) of individual or groups of cells to be charted within the central nervous system (CNS)",
          "For retrograde transport, the tracer material is applied to a Æbre tract or a terminal Æeld of innervation, becomes incorporated into the cell axons (usually by a process of endocytosis), and is then carried back to the parent cell body",
          "For anterograde transport, the uptake mechanisms involve the cell soma and/or its dendrites, and the tracer material is transported along the axonal microtubular system to the cell's synaptic terminals."
        ],
        "Retrograde tract tracing" : [
          "Destruction of a target region of the brain leads to retrograde degeneration of the axons projecting to that region and, ultimately, to chromatolysis of the cells of origin of the pathway under study.",
          "Since degenerating Æbres can be visualised with silver impregnation techniques, the course of the Æbre tract can be charted from the lesion site along its length back to the cells of origin (Nauta and Gygax, 1954).",
          "major breakthrough has undoubtedly been the discovery that the plant enzyme horseradish peroxidase (HRP) is taken up by axons and transferred back to cell somata by active retrograde transport. The enzyme reaction may then be used to stain the cell body and its major dendrites",
          "Subsequently, many new substances have been found that are useful for retrograde tracing. Of particular importance are Øuorescent dyes of various colours, which can be combined in the same experiment for multiple retrograde labelling",
          "Such developments have been motivated partly by whether or not the axon of a parent neurone can branch to more than one target. As a result, a range of dierent substances are available for double (and multiple) retrograde labelling studies, including modiÆcations of various HRP techniques"
        ],
        "Anterograde tract tracing" : [
          "The tracer material is carried actively within the nerve Æbres, but the transported substance moves from the cell body towards the axon terminals.",
          "The advantages of using tritiated amino acids are that they are readily incorporated into newly synthesised peptides, are transported across the synaptic cleft, and have a small molecular weight.",
          "The disadvantages include their hydrophilic properties, which limit their diusion within the extracellular space, resulting in a restricted selectivity for certain cells or projections."
        ],
        "General aspects of neuroanatomical tracing" : [
          "Three basic methods are used to deliver tracer material into the target tissue: pressure injection, iontophoretic injection and the mechanical insertion of dye crystals.",
          "or by means of a hydraulic system. The latter is often preferable because it enables the injection volume to be controlled accurately.",
          "racer molecules usually carry an electrical charge and can therefore be ejected from the pipette by an applied electrical current. Current is applied through a micropipette containing the tracer solution (typically, at a concentration of about 1±10%). With appropriate electrode tip diameters, this technique can be used for both intracellular and extracellular applications.",
          "The insertion of crystalline dyes is feasible when the target tissue is normally readily accessible. As the labelling eÅciency is very high and placement of the crystals can be carried out under microscopic control, this is the method of choice for focal applications of carbocyanine dyes such as DiI and 4-4-didecylaminostyrylN-methyl-pyridinium iodide (DiAsp)",
          "By contrast, propidium iodide (PI) and FB are more readily taken up via intact terminals than through disrupted axons. Such retrograde markers do not easily enter axons en passage and are therefore better suited for studies seeking to identify the origin of neurones terminating at the application site.",
          "Active uptake is one of the advantages of the lectins (Gerfen and Sawchenko, 1984). These plant-derived tracers bind to the sugar moieties of membrane-bound glycoproteins and glycolipids. Since receptor-mediated internalisation is very eÅcient, lower concentrations of tracer (between 1 and 5%) suÅce. For instance, WGA±HRP is internalised at a much higher rate than HRP alone."
        ],
        "Passive incorporation" : [
          "Substances that diuse passively into neurones enter because of the local concentration gradient. They must therefore be present at higher concentrations at the application site (20±50%).",
          "Water-soluble tracers like HRP or FB reach the cytoplasm via the active transport of endosomes. Dyes that occur as weak bases diffuse through the membranes of intracellular vesicles.",
          "The incorporation of lipids into membranes is eÅcient so that Øuorescent dyes are generally given in low concentrations of 1±5%"
        ],
        "Active transport in vesicles" : [
          "There are two ways in which tracers are distributed within the neurones: active transport in vesicles and lateral diusion within the plane of the membrane. Active vesicular transport seems to be the only eÅcient transfer mechanism for longer distances in vivo.",
          "By means of pH-trapping or the ingestion of labelled membrane fragments, the tracer accumulates in vesicles, and these are actively carried along the cytoskeleton of axons and dendrites. Fast axonal transport can reach velocities in the order of 2 cm/day",
          "Retrogradely transported HRP, CTB and Øuorescent markers that remain in vesicles produce a granular appearance in the cell soma, and consequently do not display the morphology of neuronal processes very well. Some hydrophilic substances, like FB, are more uniformly distributed within the cytoplasm",
          "Depending upon the distance to be covered by the tracer and the importance one places on tissue quality, tracing in Æxed tissues may be performed under refrigeration, at room temperature (RT), or at higher temperatures (e.g., 378C)."
        ],
        "Detection of the signal: Fluorescent tracers" : [
          "Fluorescent tracers are directly visible. This is a major advantage because labelled cells can be studied in the living tissue in vivo or in vitro, and it is feasible to perform additional experiments on the same tissue, for instance electrophysiology or the observation of growth processes in culture. However, a relative disadvantage is that Øuorescent dyes are frequently not preserved in cryostat or paraÅn sections. This can be overcome by using a vibratome or tissue chopper.",
          "There is now a large number of Øuorescent tracers available with dierent absorption spectra, thus permitting simultaneous labelling with multiple markers. These advantages of Øuorescent dyes are oset by a few drawbacks. A strong Øuorescence signal may obscure the details of smaller processes. Photobleaching, or fading of the signal after light exposure during examination, poses a problem to the application of any Øuorescent marker."
        ],
        "Fast blue" : [
          "FB is applied by pressure injection of a 3% aqueous solution. It is taken up by axon terminals rather than by injured axons. Retrograde tracing leads to uniform labelling of the cell soma without much staining of dendrites. The blue Øuorescence requires excitation in the ultraviolet range (360 nm) and is subject to high phototoxicity at longer illumination times.",
          ""
        ]
      }
    },
    {
      "title" : "The economy of brain network organization",
      "phrases" : {
        "Introduction" : [
          "Like an airline network, the topological formation of the Internet is strongly constrained by its physical properties, including the greater wiring cost of longer-distance links (cables) between nodes.",
          "However, some of the adaptive behaviours of a brain network — such as its capacity for information processing and its robustness to adverse perturbation — are probably related to topological properties that would not have emerged if cost minimization was the only factor to drive brain organization.",
          "For example, if a parsimonious principle of cost control was the only criterion for brain network selection, we would not expect to see high global efficiency of information transfer between processing nodes (neurons or brain regions) located far apart from each other in anatomical space",
          "These considerations suggest that brain networks may be selected to negotiate a tradeoff between competitive criteria of minimizing wiring cost and maximizing adaptive value19,21, a trade-off that underpins the economy of brain network organization.",
          "Similarly, we could say that the brain is a successful producer if its adaptive value to the organism exceeds its biological costs.",
          "Furthermore, we propose that evolutionary or developmental selection criteria have acted as ‘customers’ in the market for adaptive behaviour that brains are supplying and, as a result, brain networks are selected — like profitable businesses — to optimize a trade-off between",
          "Which quantifiable aspects of brain organization are important for cost control?",
        ],
        "Brain networks are expensive" : [
          "White-matter volume grows faster than grey-matter volume as a function of increasing brain and body size, and this seems to be driven by increases in axonal diameter and in the number of synapses per neuron35.",
          "The differentrates of increase in grey- and white-matter volume with increasing cerebral cortex size observed in primates implies that the fraction of grey-matter neurons that send myelinated axons into the white matter slowly reduces with brain size, thus resulting in increasingly sparse long-range connections among grey-matter neurons in larger brains36,37.",
          "Similarly, at a macroscopic scale, a shorter distance between two brain regions is a strong predictor of the presence42 and the density of connecting axonal projections between these two regions43, indicating that the probability distribution of connection distances is skewed towards short distances that will be relatively parsimonious in terms of wiring cost44.",
          "However, it is also clear that brain networks are not absolutely minimized for wiring cost48. Various countervailing factors prevent strict cost minimization of brain networks. At least in cellular systems, volume exclusion is a factor that exacts a cost premium: as neuronal elements are packed into a finite volume, some axonal projections must be perturbed from the minimal-cost straight line and some cell bodies must be displaced from their optimal spatial locations38.",
          "Another plausible factor that might compete with wiring-cost minimization is the functional or behavioural properties of the network, which are assumed to be related to its connectivity or topology",
          "In  another example, the strength of synchronized oscillations in neuronal networks is enhanced when the wiring cost of the networks is increased above minimum by the inclusion of long-distance axonal projections, which mediate topological short-cuts between spatially remote oscillators37.",
          "Graph theoretical models of neuronal morphology that incorporated a competition (or a trade-off) between wiring cost minimization and path length minimization generated remarkably realistic simulations of diverse neuronal types and their laminar packing patterns in cortex26. We will return to this theme of a trade-off between wiring cost and network topology as we articulate an economic model of brain network organization.",
          "The metabolic (or energetic) cost of the brain follows an allometric scaling relationship with brain volume: anatomically bigger brains are metabolically more expensive.",
          "Much of the brain’s massive metabolic cost is attributable to the active maintenance of electrochemical gradients across neuronal membranes, which is required to support signalling and coordination of neuronal activity at anatomically separated sites29,49.",
          "The metabolic costs of the brain increase in proportion to the total surface area of the neuronal membrane that must be biochemically maintained in readiness for transmission of electrical signals;",
          "Controlling the wiring cost — by minimizing the length of anatomical connections in the network — will therefore also conserve potential running costs. However, there is strong evidence that metabolic costs are controlled dynamically within the upper limit imposed by the anatomical architecture of the network. That is, brain networks are often functionally activated or configured less expensively than they could be within the anatomical constraints, so that metabolic resource is used frugally.",
          "Some well-known examples of such control of running costs are: sparse oding strategies, by which great diversity of information representation can be achieved for low metabolic cost52; the repetition suppression of neuronal response to repeated presentation of visual stimuli53; and the habituation of limbic cortical activation to repeated emotionally valent stimulation54. Interestingly, these observations on reduced neuronal activation in response to repeated — and therefore predictable or unsurprising — stimuli suggest a possible connection between minimization of the metabolic costs of a network and minimization of prediction error in its computational performance55",
          "Computational studies suggest that functional connections correspond more closely to underlying anatomical connections when they are measured over longer time periods58",
        ],
        "Brain networks are topologically complex" : [
          "This worm brain graph was found to be neither random nor regular in pattern, having both high clustering like a regular lattice and short path-length like a random graph. The",
          "There is now strong evidence that human brain networks generally have small-world properties of high clustering and high global efficiency20, a modular community structure68–72 and heavy-tailed degree distributions63,72 that indicate a number of highly connected nodes or hubs73",
          "One idea that has emerged from a high-level synthesis of this spectrum of ‘network science’ is that the important topological properties shared by many different systems may reflect their formation in response to shared selection pressures7",
          "Modules consisting of highly interconnected brain regions often reflect their spatial arrangement69, such that within-module connections tend to be shorter than between-module connections. This way, spatial modules help to conserve cost related to wiring and communication and improve the local efficiency of specialized neural computations.",
          "Computational studies suggest additional advantages of modular organization: modular networks deal more effectively with the increased processing demands imposed by variable environments152,153, and modularity confers a degree of resilience against dynamic perturbations and small variations in structural connectivity154. Hierarchical arrangement of modules further extends these benefits over multiple spatial scales107."
        ]
      }
    }
  ]
}